{"name":"장주욱","email":"jjang@sogang.ac.kr","introduce":"블록체인, AI, IoT, 차세대 네트워크 연구 선구자","keywords":["분산시스템","공급망관리","인공지능","데이터보안","핸드오버","전자투표","네트워크최적화","IoT보안","사물인터넷","블록체인","스마트컨트랙트","에너지거래","NFT","무선통신","센서네트워크"],"skills":[],"cards":[{"type":"text","name":"AI 요약","data":"서강대학교 전자공학전공 장주욱 교수는 블록체인, AI, IoT, 그리고 차세대 네트워크 기술 분야의 선구적인 연구를 수행하고 있습니다. 교수는 블록체인 기반의 에너지 거래, 데이터 접근 관리, 스마트 이벤트 시스템 개발 등 다양한 혁신 기술을 특허로 출원하며 실제 적용 가능성을 탐구하고 있습니다. 또한, IoT 환경의 신뢰성 및 보안 강화, 무선 통신 시스템의 효율성 증대에 관한 깊이 있는 연구를 통해 통신 기술 발전에 기여하고 있습니다. 최근에는 인공지능 관련 교육 및 연구 주제 발굴 기획 과제에 참여하여, 급변하는 디지털 시대에 필요한 새로운 융합 기술 개발과 인재 양성에도 적극적으로 임하고 있습니다."},{"type":"table","name":"기본 정보","data":[{"cells":[{"name":"소속","value":"서강대학교"},{"name":"부서/학과","value":"전자공학과"},{"name":"직책","value":"교수"},{"name":"사무실 번호","value":"027058472"}]},{"cells":[{"name":"연구실","value":"MONET"}]}]},{"type":"links","name":"연락처 및 링크","data":[{"name":"이메일","href":"mailto:jjang@sogang.ac.kr"},{"name":"연구자 홈페이지","href":"http://monet2.sogang.ac.kr/people/index.php"},{"name":"연구실 홈페이지","href":"http://monet2.sogang.ac.kr/"}]},{"type":"text","name":"연구분야: 블록체인 기술 및 융합 응용","data":"장주욱 교수는 블록체인 기술의 선구적인 연구를 통해 다양한 산업 분야의 혁신을 이끌고 있습니다. 특히, 블록체인 기반 에너지 거래, 데이터 접근 관리, 스마트 이벤트 시스템 개발, 전자투표 시스템 구현 등 실생활에 적용 가능한 솔루션 개발에 주력하고 있습니다. 이러한 연구는 '차세대 블록체인 핵심기술 및 응용 연구'와 '적응형 블록체인 플랫폼 기술 개발' 같은 주요 국책 과제를 통해 구체화되었으며, ㈜지엠비블록체인시큐리티 창업을 통해 스마트 컨트랙트 취약성 검출 기술 개발에도 기여했습니다. 블록 사이즈 조절, P2P 에너지 거래, NFT 티켓 관리, 온라인 시험, 국가 재난 관리, 공급망 관리 등 광범위한 블록체인 응용 특허를 보유하고 있으며, 블록체인 기반의 익명 투표 및 에너지 거래 시스템에 대한 SCI급 논문을 발표하는 등 이론과 실제를 겸비한 연구 성과를 지속적으로 창출하고 있습니다. 이 분야의 연구는 투명하고 안전한 디지털 생태계 구축에 핵심적인 역할을 할 것으로 기대됩니다."},{"type":"text","name":"연구분야: 사물인터넷(IoT) 및 차세대 무선 통신","data":"장주욱 교수는 사물인터넷(IoT) 환경의 신뢰성 및 보안 강화와 차세대 무선 통신 시스템의 효율성 증대에 관한 깊이 있는 연구를 수행하고 있습니다. 센서 네트워크, 모바일 네트워크, 자동차 네트워크 등 다양한 환경에서의 IoT 보안, 데이터 전송 효율화, 에너지 하비스팅 기술 개발에 집중하고 있습니다. '블록체인 기반 IoT 신뢰성 제어 및 관리 기술 개발', 'WiMAX 모바일 단말에서의 에너지 절약', '차세대 무선네트워크 핸드오버시 TCP 성능' 등 다수의 연구 과제를 수행하며 실질적인 기술 발전에 기여했습니다. 특히, 대규모 IoT 장치의 효율적인 접근 방안, 인지 무선 센서 네트워크의 채널 관리, 에너지 하비스팅 환경에서의 자원 최적화 등 복잡한 무선 통신 환경에서의 문제 해결에 대한 다수의 SCI급 논문을 발표했습니다. IoT 기반 무기류 통제, 컨텍스트 기반 보안, 스마트 가로등 시스템, 무선 통신 시스템의 핸드오버 및 스케줄링 방법 등 IoT 및 무선 통신 관련 특허들을 통해 실용적인 응용 가능성을 입증하고 있습니다. 이 연구는 연결성 및 효율성이 강조되는 미래 통신 환경의 핵심 기술을 제공합니다."},{"type":"text","name":"연구분야: 분산 시스템 및 지능형 데이터 보안","data":"장주욱 교수는 분산 시스템 환경에서의 데이터 보안 및 관리 분야에서 독보적인 전문성을 가지고 있습니다. 초기 병렬 처리 및 비디오 화상회의 시스템 개발 경력을 바탕으로, 인터넷 보안과 컴퓨터·소프트웨어 기반 융합 연구를 선도하고 있습니다. 특히, 블록체인 기반의 데이터 접근 관리, 포그 컴퓨터 보안 및 디바이스 제어, 파일 관리 및 검색, 온라인 시험 관리, 국가 재난 관리, 공급망 관리 등 광범위한 영역에서 지능형 보안 시스템 구축에 집중하고 있습니다. 사용자의 컨텍스트에 따른 네트워크 연결 제어, 메시지의 우선권 및 실시간성 보장을 위한 메시지 중재 방법 등 고도화된 보안 및 제어 기술을 특허로 등록했습니다. 또한, 블록체인 네트워크에서의 데이터 저장 용량 확장 방법, 트랜잭션 충돌 방지, 처리 성능 향상 등 분산 시스템의 효율성과 안정성을 높이는 연구에도 기여하고 있습니다. 이 연구는 분산 환경에서 발생하는 다양한 보안 위협에 대응하고, 데이터의 무결성과 신뢰성을 확보하는 데 필수적인 기술적 기반을 제공합니다."},{"type":"table","name":"학력","data":[{"cells":[{"name":"학위","value":"Ph. D."},{"name":"학교","value":"University of Southern California"},{"name":"졸업 연도","value":"1993"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관명","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]},{"type":"text","name":"보유 기술","data":""}]}