{"name":"허남건","email":"tlo@sogang.ac.kr","introduce":"열유체 시스템 해석 권위자","keywords":["유동해석","CFD","산업설비","풍력","공기청정기","수소확산","교반기","시스템최적화","전산유체역학","터널환기","기계공학","열교환기","혈액유동","시뮬레이션","열해석"],"skills":[],"cards":[{"type":"text","name":"AI 요약","data":"서강대학교 기계공학과 허남건 교수는 유체역학 및 열유체 해석 분야의 권위자입니다. 산업용 교반기, 펌프, 자동차 시스템, 수소 안전, 환기 시스템, 생체 유동 등 다양한 분야에서 전산유체역학(CFD) 기반의 혁신적인 연구를 수행하고 있습니다. 복잡한 유동 및 열전달 현상을 정밀하게 분석하고 예측하여, 고효율 설계 및 문제 해결에 기여합니다. 허남건 교수의 심층적인 연구는 다양한 산업 분야의 기술 혁신과 성능 향상에 필수적인 통찰력을 제공하고 있습니다."},{"type":"text","name":"연구분야: 전산유체역학(CFD) 기반 유동 및 열유체 시스템 해석","data":"본 연구실은 전산유체역학(CFD)을 핵심 도구로 활용하여 복잡한 유동 및 열전달 현상을 정밀하게 분석하고 예측하는 데 독보적인 전문성을 가지고 있습니다. 특히, 고성능 컴퓨팅 환경에서 다상 유동, 난류, 반응 유동 등 난해한 물리적 시스템 내의 유체 거동과 열 에너지 전달 메커니즘을 심층적으로 이해하고, 이를 바탕으로 최적의 설계 및 성능 개선 방안을 제시합니다. 실제 산업 현장에서 발생하는 다양한 문제들을 효과적으로 시뮬레이션하고 해결하며, 제품 개발 주기 단축, 에너지 효율 향상, 그리고 시스템 안정성 증대 등 실질적인 가치를 창출합니다. 연구의 목표는 이론적 해석과 최첨단 수치적 시뮬레이션 기법의 결합을 통해 현상을 명확히 규명하고, 혁신적인 기술 솔루션을 제공하는 데 있습니다."},{"type":"text","name":"연구분야: 산업 및 수송 시스템 유동/열 최적화","data":"본 연구실은 산업용 교반기, 펌프, 열교환기 등 다양한 산업 설비와 자동차 시스템의 유동 및 열 거동을 최적화하는 데 집중합니다. 산업용 교반기의 유동 패턴 분석을 통한 혼합 효율 극대화, 펌프 내부 유동 해석을 통한 고효율 설계, 열교환기의 열전달 성능 향상 연구를 통해 에너지 소비 절감과 시스템 수명 연장을 실현합니다. 자동차 분야에서는 도장 건조 공정의 열유동 모델링으로 품질을 향상시키고, 차량용 오일 쿨러 및 와이퍼 시스템의 공력 성능을 최적화하는 등 광범위한 문제 해결에 기여합니다. 이러한 연구는 실제 제품 개발에 직접 적용되어 생산성 증대와 원가 절감 효과를 가져오며, 친환경적이고 지속 가능한 산업 발전에 필수적인 핵심 기술을 제공합니다."},{"type":"text","name":"연구분야: 수소 안전 및 환경/생체 유동 모델링","data":"허남건 교수의 연구는 미래 에너지 기술인 수소의 안전성 확보와 공공 환경, 그리고 생체 유동 분야로 그 영역을 확장하고 있습니다. 수소 누설 시 확산 거동을 정밀하게 예측하고, 안전한 환기 시스템 설계를 위한 CFD 분석을 수행하여 수소차, 수소 충전소, 터널 등 다양한 환경에서의 안전 기준 마련에 핵심적인 기여를 합니다. 나아가, 터널 환기 시스템의 최적화, 공기청정기 성능 평가 등 환경 유동 제어 연구를 통해 쾌적하고 안전한 생활 공간 조성에 중점을 둡니다. 의학 분야에서는 혈액의 용혈 및 응혈 특성 모델링, 혈액 펌프 내부 유동 해석, 동맥 내 혈류역학 분석 등 생체 유동 시뮬레이션을 통해 의료기기 개발 및 질병 진단 보조 기술 발전에 기여합니다. 이러한 융합 연구는 산업적 응용을 넘어 사회 안전망 강화와 인류 건강 증진에 이바지하는 중요한 가치를 창출합니다."},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관","value":"서강대학교"}]},{"cells":[{"name":"담당자","value":"서강대학교산학협력단"}]},{"cells":[{"name":"이메일","value":"tlo@sogang.ac.kr"}]},{"cells":[{"name":"연락처","value":"02-3274-4863"}]}]}]}