{"name":"손원민","email":"tlo@sogang.ac.kr","introduce":"양자 기술 선도 연구자","keywords":["양자 정보","데이터 보안","양자 암호","비트오류 보정","보안 기술","양자 하드웨어","기계 학습","양자 기술","양자 통신","병렬 처리","양자 물리학","양자 알고리즘","양자 컴퓨팅"],"skills":["양자 컴퓨팅","양자 알고리즘 개발","양자 통신","양자 암호","기계 학습","양자 하드웨어 구축","비트오류 보정","양자 상관관계 분석","양자 측정 이론"],"cards":[{"type":"text","name":"AI 요약","data":"손원민 교수는 서강대학교 물리학전공 조교수로서, 양자 기술 분야의 선도적인 연구를 수행하고 있습니다. 특히, 기계 학습을 통한 새로운 양자 알고리즘 개발 및 고 신뢰도 양자 하드웨어 구축, 양자 통신 안전성 연구 등 다양한 국가 과제에 참여하며 이 분야의 발전에 기여해 왔습니다. 또한, 워드 마스크를 이용한 고속 병렬 비트오류 보정방법 특허를 보유하고 있어, 양자암호 및 통신 보안 기술에 대한 깊이 있는 이해와 실질적인 기여를 보여주고 있습니다. 그의 연구는 미래 양자 통신 및 컴퓨팅 기술의 안전성과 효율성을 확보하는 데 중요한 기반을 제공합니다."},{"type":"text","name":"연구분야: 양자 컴퓨팅 및 알고리즘 개발","data":"본 연구실은 차세대 연산 기술인 양자 컴퓨팅의 핵심 요소를 개발하고 발전시키는 데 중점을 두고 있습니다. 특히 기계 학습 기법을 활용하여 기존의 한계를 뛰어넘는 새로운 양자 알고리즘을 탐색하고, 이를 실제 구현 가능한 고신뢰도 양자 하드웨어에 적용하기 위한 연구를 수행하고 있습니다. 양자 주파수 모사 시스템 및 코드 제작을 통해 양자 하드웨어의 설계 기반을 마련하고 있으며, 1D 배열 큐비트 시뮬레이션, 양자 위상 전이 연구, 토폴로지 질서 생성 등 양자 컴퓨팅의 근본 원리 및 구현 가능성을 다각적으로 탐구하고 있습니다. 이러한 연구는 복잡한 계산 문제를 혁신적으로 해결하고, 난제였던 과학 분야에서의 새로운 발견을 가능하게 하여 미래 양자 컴퓨팅 기술의 설계 및 실용화에 핵심적인 기반을 제공합니다."},{"type":"text","name":"연구분야: 양자 통신 및 보안 기술","data":"본 연구실은 미래 통신 환경에서 절대적인 보안을 제공할 양자 통신 및 양자 암호 기술 개발에 주력하고 있습니다. 특히 양자키분배(QKD) 기술의 효율성과 안전성을 극대화하기 위한 연구를 심층적으로 수행합니다. 비국소성을 활용한 기기 무관 양자통신 안전성 연구, 엔트로피 불확정성 및 양자통신 안전성 상호연관성 분석, 비국소적 측정된 양자암호의 물리적 안전성 분석 등을 통해 양자 통신의 근본적인 보안 메커니즘을 규명합니다. 또한, 워드 마스크를 이용한 고속 병렬 비트오류 보정방법 특허를 보유하여 양자 통신 시스템의 실용성을 높이는 데 핵심적인 기여를 하고 있습니다. 3차원 양자 상태 및 하이브리드 인코딩 기법을 활용한 QKD 효율 향상 연구를 통해 통신 속도와 보안 수준을 동시에 개선합니다. 이러한 연구는 양자암호 네트워킹 핵심 기술 및 양자키분배용 후처리 기술 개발로 이어져 실제 통신 환경에 적용 가능한 혁신적인 보안 솔루션을 제공하며, 미래 데이터 보안 인프라 구축에 필수적인 역할을 수행하고 있습니다."},{"type":"text","name":"연구분야: 양자 상관관계 및 양자 측정 이론","data":"본 연구실은 양자 물리학의 핵심이자 양자 기술의 근간이 되는 양자 상관관계 및 양자 측정 이론에 대한 심도 깊은 연구를 수행하고 있습니다. 양자 정보 과학의 기본 원리를 깊이 이해하고, 이를 바탕으로 새로운 양자 현상을 탐구하는 데 집중합니다. 특히 초상관관계(hyper-correlations) 이론, 스핀-1 체인의 양자 위상 전이에서의 벨 유형 상관관계, 유사 확률 함수를 이용한 양자 상관관계 테스트, 일반화된 측정에 대한 엔트로피 불확정성 관계 등 다양한 양자 상관관계 현상을 이론적, 실험적으로 분석합니다. 다차원 양자 상관관계의 기능적 한계에 대한 공리적 접근 방식, 엔트로피 불확정성 관계에서 양자 비-가우시안 거리의 역할, 연속적 투영 측정에 대한 최적화된 엔트로피 불확정성 등에 대한 연구를 통해 양자 측정의 불확실성과 그 영향을 규명합니다. 이러한 기초 연구는 양자 통신 및 양자 컴퓨팅 기술의 근본적인 이해를 심화시키고, 나아가 혁신적인 양자 기술 개발을 위한 이론적 토대를 견고히 함으로써 양자 정보 과학 전반의 발전에 기여하고 있습니다."},{"type":"links","name":"문의처","data":[{"name":"서강대학교산학협력단 이메일","href":"mailto:tlo@sogang.ac.kr"},{"name":"서강대학교산학협력단 연락처","href":"tel:02-3274-4863"}]}]}