{"name":"윤경병","email":"tlo@sogang.ac.kr","introduce":"신소재/인공광합성 연구 선도","keywords":["촉매 개발","멤브레인","바이오센서","물리화학","수소 생산","화학공학","이산화탄소 환원","신소재","나노물질","에너지","제올라이트","흡착제","수전해","인공광합성","환경"],"skills":[],"cards":[{"type":"text","name":"AI 요약","data":"서강대학교 화학전공 윤경병 교수님은 제올라이트 기반의 신소재 개발, 인공광합성을 통한 에너지 및 환경 문제 해결 연구에 매진하고 계십니다. 특히, CO₂ 전환 촉매, 수전해 전극 기술, 방사성 Sr 이온 흡착제 개발 등 친환경 미래 기술 혁신을 위한 핵심 연구를 선도하고 있습니다. 다수의 국책 과제 수행과 SCI급 논문, 특허 등록으로 학술적 깊이와 실용적 가치를 동시에 입증하고 있으며, 이를 통해 지속 가능한 사회 구축에 기여하고 있습니다. 윤경병 교수님의 탁월한 연구 업적은 과학 기술 발전에 큰 영감을 제공합니다."},{"type":"text","name":"제올라이트 기반 기능성 신소재 개발 및 응용","data":"본 연구실은 제올라이트의 독특한 다공성 구조와 뛰어난 화학적 안정성을 활용하여 다양한 기능성 신소재 개발에 매진하고 있습니다. 촉매, 흡착제, 멤브레인, 바이오센서 등 광범위한 응용 분야에서 핵심적인 역할을 수행할 수 있는 물질을 설계하고 있습니다. 특히, 대기 중 이산화탄소 포집을 위한 고성능 마이크로 다공성 구리실리케이트(SGU-29) 흡착제 개발은 온실가스 저감 및 탄소 자원화에 기여하며 상용화 가능성을 입증했습니다. 또한, 방사성 핵폐기물 내 Sr(II) 이온과 같은 유해 중금속 이온을 고효율로 제거하는 층상 바나도실리케이트 흡착제 개발을 통해 환경 정화 기술 혁신을 선도하고 있습니다. 제올라이트 결정의 조직화 및 박막 제조 기술은 수소 이온 수송 멤브레인, 바이오센서 등 차세대 응용 분야로의 확장을 가능하게 하며, 에너지 효율 증대 및 정밀 분석을 위한 새로운 길을 열고 있습니다. 이러한 연구는 지속 가능한 사회 구현을 위한 친환경적이고 효율적인 물질 솔루션을 제공합니다."},{"type":"text","name":"인공광합성 기반 CO2 전환 및 수소 에너지 기술","data":"본 연구실은 기후 변화 대응 및 미래 에너지 문제 해결을 위해 인공광합성 및 청정 에너지 전환 기술 개발에 집중하고 있습니다. 태양광 에너지를 활용하여 물을 분해하여 수소를 생산하고, 대기 중 이산화탄소(CO2)를 메탄올, 일산화탄소(CO)와 같은 유용한 화학물질 및 연료로 전환하는 고효율 시스템을 연구합니다. 특히, Cu-loaded TiO2를 이용한 140℃에서의 태양광 광열 물 분해 기술과 이리듐 산화물이 도핑된 코발트 산화물 전극을 활용한 고효율 수전해 기술은 수소 생산의 경제성과 효율성을 극대화합니다. CO2를 CO로 전환하는 촉매 개발과 전기화학적 이산화탄소 환원 반응에 대한 심층 연구는 탄소 중립 사회를 위한 핵심 기술을 제공합니다. 이러한 연구는 국책 과제인 '인공광합성 구현과 실용화를 위한 기초과학 확보 및 원천기술 개발'을 통해 학술적 깊이와 실용적 가치를 동시에 추구하며, 지속 가능한 미래 에너지 시스템 구축에 기여하고 있습니다."},{"type":"text","name":"환경 유해물질 고효율 흡착 및 제거 기술","data":"본 연구실은 환경 내 유해 오염물질로부터 안전한 사회를 구축하기 위한 혁신적인 제거 기술 개발에 집중하고 있습니다. 특히, 원자력 폐기물에서 발생하는 Sr-90과 같은 방사성 동위원소를 고농도 나트륨 환경에서도 선택적이고 효율적으로 제거하는 층상 바나도실리케이트 기반의 흡착제 개발에 성공했습니다. 이 기술은 방사성 폐기물 처리의 난제를 해결하며 환경 안전성을 크게 향상시킬 수 있습니다. 또한, 습한 배출가스 및 대기 중의 이산화탄소를 효과적으로 포집하는 마이크로 다공성 구리실리케이트 흡착제(SGU-29)는 기후변화 대응을 위한 핵심 기술로 주목받고 있습니다. 이 외에도 요오드 및 유기 요오드와 같은 휘발성 유해물질을 포집하기 위한 실리카 제올라이트 흡착제 연구를 통해 다양한 환경 오염물질에 대한 포괄적인 해결책을 모색하고 있습니다. 이러한 연구는 환경 복원 및 오염물질 관리 분야에서 실질적인 기여를 하며, 인류의 건강과 지속 가능한 환경을 보존하는 데 중요한 역할을 합니다."},{"type":"table","name":"경력 정보","data":[{"cells":[{"name":"기간","value":"2021.09 - 현재"},{"name":"직위","value":"Loyola Chair Professor"}]},{"cells":[{"name":"기간","value":"2009.09 - 2019.09"},{"name":"직위","value":"Director, Korea Center for Artificial Photosynthesis"}]},{"cells":[{"name":"기간","value":"2009.06 - 2011.06"},{"name":"직위","value":"Dean, College of Natural Science"}]},{"cells":[{"name":"기간","value":"2006.04 - 2021.08"},{"name":"직위","value":"Director, Center for Nano Materials"}]},{"cells":[{"name":"기간","value":"1989.09 - 2021.08"},{"name":"직위","value":"Assistant Professor, Associate Professor, and Professor"}]}]},{"type":"table","name":"수상 이력","data":[{"cells":[{"name":"연도","value":"2007"},{"name":"수상 내용","value":"Taikyue Ree Academic Award, Korean Chemical Society"}]},{"cells":[{"name":"연도","value":"2008"},{"name":"수상 내용","value":"Academic Award, National Academy of Science of Korea"}]},{"cells":[{"name":"연도","value":"2010"},{"name":"수상 내용","value":"Korea Science Award"}]}]},{"type":"table","name":"학력","data":[{"cells":[{"name":"연도","value":"1979"},{"name":"학위","value":"B.S."},{"name":"학교","value":"Seoul National University, Seoul, Korea"}]},{"cells":[{"name":"연도","value":"1981"},{"name":"학위","value":"M.S."},{"name":"학교","value":"Korea Advanced Institute of Science and Technology (KAIST), Seoul, Korea"}]},{"cells":[{"name":"연도","value":"1989"},{"name":"학위","value":"Ph.D."},{"name":"학교","value":"University of Houston, Texas, USA"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]}]}