{"name":"윤광석","email":"ksyun@sogang.ac.kr","introduce":"AI, 에너지, 센서/햅틱 연구 선도","keywords":["마이크로 유체","가스 센서","기술사업화","AI 반도체","나노기술","슈퍼커패시터","압전소자","웨어러블 센서","바이오 센서","에너지 하베스팅","시스템반도체","공동 연구","MEMS","마찰전기","햅틱 기술"],"skills":["AI 시스템 반도체 설계","지능형 마이크로시스템","에너지 하베스팅","차세대 전력 저장 소자","첨단 센서 개발","햅틱 인터페이스 기술","MEMS","뉴로모픽 소자 개발","슈퍼커패시터","압전/마찰전기 에너지 수확 소자","유연/촉각 센서","바이오 센서","마이크로유체 칩 기술"],"cards":[{"type":"links","name":"교수 정보","data":[{"name":"소속","href":"https://www.sogang.ac.kr"},{"name":"부서","href":"https://ee.sogang.ac.kr"},{"name":"직책","href":"#"},{"name":"사무실 번호","href":"#"},{"name":"이메일","href":"mailto:ksyun@sogang.ac.kr"},{"name":"연구자 홈페이지","href":"https://sites.google.com/view/ksyun/people/professor?authuser=0"},{"name":"연구실","href":"#"},{"name":"연구실 홈페이지","href":"https://sites.google.com/view/ksyun"}]},{"type":"text","name":"연구분야: AI 시스템 반도체 및 지능형 마이크로시스템","data":"본 연구실은 인공지능(AI) 서비스의 실현을 위한 차세대 시스템 반도체 및 지능형 마이크로시스템 연구를 선도하고 있습니다. 엣지 디바이스 환경에 최적화된 AI 반도체 인력 양성 및 핵심 기술 개발에 주력하며, 고성능, 초저전력, 초고집적 지능형 반도체 구현을 목표로 합니다. 특히, 인간의 뇌 기능을 모방하는 광 시냅스 트랜지스터와 같은 뉴로모픽 소자 개발을 통해 메모리 상태를 오래 유지하고 광전류 효율을 극대화하는 혁신적인 기술을 선보이고 있습니다. 이러한 연구는 지능형 센서와 마이크로시스템의 융합을 통해 자율주행, 스마트 팩토리, 사물 인터넷(IoT) 등 다양한 AI 기반 산업의 핵심 하드웨어 솔루션을 제공하며, 미래 인공지능 기술 발전에 필수적인 기반을 마련하고 있습니다. 서강대학교 지능형시스템반도체 특성화 교육연구단의 비전 아래, 글로벌 수준의 지능형 반도체 인력 양성 및 차별화된 융복합 연구를 통해 사회적, 산업적 파급 효과를 창출하고 있습니다. 기업과의 협력을 통해 실제 산업 적용 가능성을 높이고 있으며, 최첨단 반도체 공정 기술을 활용하여 고감도 저전력 센서와 지능형 융복합 시스템 구현에 기여하고 있습니다."},{"type":"text","name":"연구분야: 에너지 하베스팅 및 차세대 전력 저장 소자","data":"본 연구실은 사물 인터넷(IoT) 및 웨어러블 디바이스의 자가 전원 공급을 위한 에너지 하베스팅 및 고효율 전력 저장 소자 기술 개발에 집중하고 있습니다. 주변 환경에서 버려지는 기계적 에너지를 전기로 변환하는 압전 및 마찰전기 에너지 수확 소자에 대한 심도 깊은 연구를 수행하며, 특히 직조형 구조, 나선형 구조, 다층 필름 등 다양한 형태의 유연하고 신축성 있는 에너지 수확 소자를 개발하여 효율을 극대화하고 있습니다. 또한, 초고용량 에너지 저장을 위한 슈퍼커패시터 연구에서도 독보적인 성과를 내고 있습니다. 나노 구조의 전극 활물질과 젤 형태의 전해질을 활용하여 정전용량을 획기적으로 높인 플렉서블 슈퍼커패시터 및 비대칭 슈퍼커패시터 제조 기술을 보유하고 있습니다. 이러한 기술은 웨어러블 센서 시스템, 의료 기기, 스마트 섬유 등 차세대 전자 기기의 지속 가능한 전원 솔루션을 제공하며, 무전원 자율 구동 시스템의 구현 가능성을 열고 있습니다. 최근에는 차량용 에너지 하베스팅 시트 개발을 통해 자동차 산업으로의 적용 가능성도 탐색하며, 미래 친환경 에너지 기술 발전에 기여하고 있습니다. 본 연구실의 기술은 높은 효율성과 유연성을 바탕으로 다양한 산업 분야에 혁신적인 전력 솔루션을 제공할 것입니다."},{"type":"text","name":"연구분야: 첨단 센서 및 햅틱 인터페이스 기술","data":"본 연구실은 정교하고 실용적인 첨단 센서 및 인간-기계 인터페이스(HMI) 기술 개발에 주력하고 있습니다. 특히 MEMS(미세전자기계시스템) 기반의 고감도 저전력 센서 설계 및 공정 기술을 바탕으로 다양한 응용 분야의 센서를 개발하고 있습니다. 웨어러블 센서 분야에서는 의복형 센서, 피부 부착형 생체신호 측정 의류, 유연한 촉각 센서 배열 등을 연구하여 실시간 건강 모니터링 및 로봇 제어에 활용될 수 있는 기술을 제시합니다. 가스 센서 분야에서는 다공성 금속 유기 골격체(MOF) 및 나노 구조를 활용한 고감도 수소/H2S 가스 센서를 개발하여 산업 및 환경 모니터링의 정확도를 높이고 있습니다. 햅틱 인터페이스 기술 분야에서는 로봇 수술 및 가상현실에 적용 가능한 3축 촉각 피드백 액추에이터와 햅틱 디스플레이 장치를 개발하여, 사용자에게 더욱 몰입감 있고 직관적인 촉각 경험을 제공합니다. 이는 단일 압력원으로 수직 및 수평 힘을 동시에 전달하는 혁신적인 햅틱 구동 기술을 포함합니다. 또한, 마이크로유체 칩 기반의 바이오 센서 기술을 통해 단일 세포 분석, 생체 물질 검출 등 바이오메디컬 분야의 정밀 진단 솔루션 개발에도 기여하고 있습니다. 본 연구실의 다학제적인 연구는 미래 센서 기술과 인간-기계 상호작용의 새로운 가능성을 열고 있습니다."},{"type":"table","name":"학력","data":[{"cells":[{"name":"기간","value":"Mar 1999 ~ Aug 2003"},{"name":"학위","value":"Ph.D."},{"name":"전공","value":"Electrical Engineering and Computer Sciences"},{"name":"기관","value":"KAIST, Korea"}]},{"cells":[{"name":"기간","value":"Mar 1997 ~ Feb 1999"},{"name":"학위","value":"M.S."},{"name":"전공","value":"Electrical Engineering"},{"name":"기관","value":"KAIST, Korea"}]},{"cells":[{"name":"기간","value":"Mar 1991 ~ Aug 1996"},{"name":"학위","value":"B.S."},{"name":"전공","value":"Electrical Engineering"},{"name":"기관","value":"Kyungpook National University, Korea"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관명","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]}]}