{"name":"지대윤","email":"tlo@sogang.ac.kr","introduce":"방사성의약품 개발 선도 교수","keywords":["BNCT 기술사업화","플루오린-18","핵의학","신약개발","화합물합성","방사성의약품","첨단의료기술","알츠하이머","진단기술","타우단백질","뇌종양진단","치료기술","의료기기","PET"],"skills":[],"cards":[{"type":"text","name":"AI 요약","data":"서강대학교 화학과 지대윤 교수는 방사성의약품 분야의 핵심 연구자입니다. 질병의 정밀 진단과 효과적인 치료를 위한 혁신적인 의약품 개발에 집중하며 플로오린-18(F-18) 표지 화합물 합성 및 PET 방사성의약품 개발을 선도합니다. 뇌종양, 알츠하이머 치매(타우 단백질) 등 난치병 진단 및 치료를 위한 독창적인 연구로 다수의 특허를 출원 및 등록하였으며, 첨단 의료기술 발전에 크게 기여하고 있습니다."},{"type":"text","name":"플로오린-18 표지 화합물 합성 및 방사성의약품 개발","data":"본 연구실은 현대 의학의 핵심 과제인 질병의 정밀 진단과 효과적인 치료를 위한 혁신적인 방사성의약품 개발에 매진하고 있습니다. 특히, 양전자방출단층촬영(PET)의 핵심 동위원소인 플로오린-18(F-18)을 이용한 표지 화합물 합성에 독보적인 전문성을 보유하고 있습니다. F-18 표지 기술은 매우 높은 민감도와 특이성을 제공하여, 극미량의 질병 관련 생체 분자를 영상화할 수 있게 합니다. 본 연구는 고효율 F-18 표지 방법론을 개발하고, 이를 다양한 생체 활성 분자에 적용하여 새로운 진단 및 치료용 방사성의약품 후보 물질을 발굴하는 데 중점을 둡니다. 예를 들어, 뇌종양 진단용 PET 방사성의약품 상용화를 위한 화합물 합성 및 F-18 표지 연구, 플로오린-18로 표지된 화합물 유도체의 합성 등 다수의 참여 과제를 성공적으로 수행했습니다. 또한, ‘High Efficiency Synthesis of F-18 Fluoromethyl Ethers’와 같은 논문 및 관련 특허를 통해 기술력을 입증하고 있습니다. 이러한 연구는 신약 개발 초기 단계부터 임상 적용까지 전 과정을 아우르며, 첨단 의료 기술 발전에 필수적인 기반을 제공하고 있습니다."},{"type":"text","name":"PET 진단용 방사성의약품 개발 및 질병 진단 응용","data":"본 연구실은 PET(양전자방출단층촬영) 진단 기술을 활용하여 뇌종양, 알츠하이머 치매 등 난치성 질환의 조기 진단 및 병기 분석을 위한 방사성의약품 개발에 집중하고 있습니다. 특히, 알츠하이머 치매의 핵심 병인 물질인 아밀로이드 베타(Aβ) 및 타우 단백질을 표적하는 방사성의약품 개발에 선도적인 역할을 하고 있습니다. '타우 단백질을 진단하기 위한 방사성의약품 개발' 과제를 통해 타우 병변을 정확하게 영상화할 수 있는 후보 물질을 탐색하고 있으며, 'Early Detection of A beta Deposition in the 5xFAD Mouse by Amyloid PET' 및 'Head-to-head comparison of <sup>11</sup>C-PiB and <sup>18</sup>F-FC119S for Aβ imaging' 등 다수의 논문을 통해 임상 적용 가능성을 제시했습니다. 또한, 뇌종양 진단용 PET 방사성의약품 상용화를 위한 연구를 지속적으로 수행하여 진단 정확도를 높이고 환자 맞춤형 치료 전략 수립에 기여하고 있습니다. 본 연구는 질병의 생체 내 변화를 실시간으로 추적하고 정량적으로 평가할 수 있는 혁신적인 진단 도구를 제공함으로써, 환자 삶의 질 향상과 의료 비용 절감에 기여하는 것을 목표로 합니다."},{"type":"text","name":"첨단 치료 및 영상 진단 융합 방사성의약품 연구","data":"본 연구실은 진단 목적을 넘어 치료 효과를 극대화할 수 있는 첨단 방사성의약품 및 융합 의료기술 연구에 주력하고 있습니다. 특히 붕소중성자포획치료(BNCT)와 같은 차세대 암 치료 기술에 사용될 전문의약품 개발에 중요한 역할을 하고 있습니다. 'BNCT 전문의약품 및 관련 영상프로브 기술개발' 과제를 통해 BNCT 치료 효과를 높일 수 있는 붕소화합물(예: B-10 농축 BPA)의 개발 및 최적화 연구를 수행하고 있습니다. 이러한 치료용 방사성의약품은 특정 질환 부위에만 방사선을 집중시켜 정상 조직의 손상을 최소화하면서 치료 효과를 극대화하는 것을 목표로 합니다. 나아가, 치료와 동시에 치료 반응을 영상으로 평가할 수 있는 테라노스틱(Theranostics) 개념의 방사성의약품 개발에도 선도적인 연구를 진행하고 있습니다. 이는 질병의 진단부터 치료, 그리고 치료 경과 모니터링까지 전주기적 관리가 가능한 미래형 의료 기술의 핵심입니다. 본 연구는 핵의학 분야의 최신 지견을 바탕으로 난치병 치료의 새로운 패러다임을 제시하며 의료기술 발전에 기여하고 있습니다."},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]}]}