{
    "name": "정문열",
    "email": null,
    "introduce": "융복합 미디어 아트 선도 권위자",
    "keywords": [
        "기술이전",
        "홀로그램",
        "융복합콘텐츠",
        "로보틱아트",
        "인공지능아트",
        "미디어아트",
        "360파노라마",
        "인터랙티브아트",
        "디지털미디어",
        "산학협력",
        "워터커튼",
        "메타버스",
        "포그스크린",
        "증강현실",
        "가상현실"
    ],
    "skills": [
        "인터랙티브 미디어",
        "실감형 콘텐츠",
        "포그 스크린",
        "360도 파노라마",
        "물방울 조형",
        "인공지능 기반 아트",
        "디지털 원단 텍스처 생성 AI",
        "로보틱 아트",
        "융복합 미디어 아트",
        "워터커튼",
        "증강현실 (AR)",
        "가상현실 (VR)",
        "DMX512 디지털 신호 제어",
        "3차원 물방울 조형 생성",
        "가상인간 대화 및 표정 실시간 생성",
        "생물모방 예술 로봇 시뮬레이션 및 제작",
        "사전 왜곡 이미지 생성 시스템",
        "돔 반사경 기술"
    ],
    "cards": [
        {
            "type": "text",
            "name": "연구분야",
            "data": "융복합 미디어 아트 및 실감 콘텐츠 기술: 본 연구실은 예술과 첨단 기술을 융합하여 새로운 형태의 미디어 아트와 실감 콘텐츠를 창조하는 데 주력하고 있습니다. 특히 포그 스크린, 워터커튼, 360도 파노라마, 증강현실(AR), 가상현실(VR) 등 몰입감 있는 경험을 제공하는 기술 개발에 선도적인 역할을 하고 있습니다. 물안개를 이용한 투명 스크린인 '포그 스크린'은 구획화된 바람 통로와 DMX512 디지털 신호 제어를 통해 물안개 밀도를 정밀하게 조절하여, 투사되는 콘텐츠에 따라 다양한 시각 효과를 구현합니다. 이는 연극, 전시, 공연 등 다양한 예술 분야에서 공간 연출의 혁신을 가져왔으며, 관련 기술 자문 및 이전 활동을 활발히 수행하고 있습니다. 또한 '3차원 물방울 조형 생성 장치'와 '360도 파노라마 이미지 투사 기술' 개발을 통해 실제 공간과 가상 콘텐츠가 자연스럽게 결합되는 증강 공간을 구현하고, 관객과의 인터랙션을 극대화하는 실감형 미디어 경험을 제공하고 있습니다. 이러한 연구는 예술적 창의성과 기술적 완성도를 겸비한 융복합 콘텐츠의 새로운 지평을 열어가고 있습니다. 인공지능 및 로보틱 아트 융합 연구: 본 연구실은 인공지능(AI)과 로보틱스 기술을 예술 창작 및 표현에 접목하는 혁신적인 연구를 수행하고 있습니다. AI 기반의 '디지털 원단 텍스처 생성 기술'은 원단 종류 및 가이드 이미지로부터 고품질의 디지털 텍스처를 생성하여 콘텐츠 제작 효율성을 높이고 새로운 시각적 경험을 제공합니다. 또한 '인공지능 및 로보틱 아트를 통한 정동(情動)의 재현' 과제를 통해 AI가 감정을 인식하고 표현하는 방식, 그리고 로봇이 예술적 행위를 수행하는 메커니즘을 탐구합니다. 이는 가상인간의 대화 및 표정 실시간 생성 시스템 개발로 이어져 메타버스 환경에서의 몰입감 있는 커뮤니케이션을 가능하게 합니다. 생물모방 예술 로봇의 시뮬레이션 및 제작을 통해 자연의 움직임과 형태를 예술적으로 재해석하고, '버츄얼캐릭터 기술 자문'과 같은 대외 활동을 통해 실제 산업에 AI 기반 예술 기술을 적용하며 그 가능성을 확장하고 있습니다. 이처럼 AI와 로봇 기술은 단순한 도구를 넘어 예술적 창의성의 새로운 원천으로서 기능하며, 미래 지향적인 예술 경험을 제시하고 있습니다. 인터랙티브 실감형 디스플레이 및 공간 기술: 본 연구실은 사용자 상호작용을 기반으로 한 실감형 디스플레이 및 공간 구현 기술 개발에 선도적인 연구를 진행하고 있습니다. 특히, '포그 스크린', '3차원 워터커튼', '360도 파노라마' 등 독자적인 디스플레이 기술을 개발하고 상용화 가능성을 모색하고 있습니다. '포그 스크린 시스템'은 물안개 밀도 조절을 통해 정교한 영상 투사가 가능하며, '3차원 물방울 조형 생성 장치' 특허 기술은 다수의 이중 배관과 제어부를 통해 물방울의 입체적인 움직임을 구현, 광고 및 전시 분야에서 새로운 시각적 경험을 제공합니다. 또한, '360도 파노라마를 위한 사전 왜곡 이미지 생성 시스템' 및 '돔 반사경' 특허를 통해 단일 프로젝터로 완벽한 파노라마 환경을 구현하는 기술력을 확보하고 있습니다. 이러한 기술들은 공연, 전시, 광고 등 다양한 분야에서 증강 공간을 생성하고, 사용자 참여를 유도하는 인터랙티브 요소를 통해 몰입감과 경험의 깊이를 더하고 있습니다. 실제 '어린이문화원 융복합 콘텐츠 포그스크린' 제작 사례와 같은 프로젝트를 통해 실용성과 예술성을 동시에 입증하고 있습니다."
        },
        {
            "type": "table",
            "name": "경력정보",
            "data": [
                {
                    "cells": [
                        {
                            "name": "기관",
                            "value": "서강대학교 메타버스전문대학원"
                        },
                        {
                            "name": "설명",
                            "value": "메타버스, 인공지능, 로보틱 아트 등 최첨단 기술과 예술을 융합하는 융복합 콘텐츠 분야 교육 및 연구를 수행하며 차세대 미디어 전문가 양성에 기여하고 있습니다."
                        }
                    ]
                },
                {
                    "cells": [
                        {
                            "name": "기관",
                            "value": "서강대학교 아트앤테크놀로지학과/영상대학원"
                        },
                        {
                            "name": "설명",
                            "value": "미디어 아트, 실감 콘텐츠, 시각 효과 등 다양한 융복합 예술 기술 분야에서 교육 및 연구를 진행하며 학생들의 창의적 문제 해결 능력을 함양하고 실무 역량 강화를 지원했습니다."
                        }
                    ]
                }
            ]
        },
        {
            "type": "text",
            "name": "대외활동",
            "data": "[기술 자문/이전] - 버츄얼캐릭터 기술 자문 용역 - 키네틱 아트 테크 자문 - 서강대학교 산학협력단 포그 스크린 시스템 기술 이전 및 사업화 자문 (특허 매각, 라이센스, 공동연구, 노하우 전수)"
        },
        {
            "type": "table",
            "name": "학력",
            "data": [
                {
                    "cells": [
                        { "name": "학위", "value": "Ph.D." },
                        {
                            "name": "기관",
                            "value": "University of Pennsylvania"
                        }
                    ]
                },
                {
                    "cells": [
                        { "name": "학위", "value": "공학석사" },
                        { "name": "기관", "value": "한국과학기술원 전산학과" }
                    ]
                },
                {
                    "cells": [
                        { "name": "학위", "value": "학사" },
                        {
                            "name": "기관",
                            "value": "서울대학교 자연대학 계산통계학과"
                        }
                    ]
                }
            ]
        },
        {
            "type": "table",
            "name": "문의처",
            "data": [
                {
                    "cells": [
                        { "name": "항목", "value": "기관" },
                        { "name": "내용", "value": "서강대학교" }
                    ]
                },
                {
                    "cells": [
                        { "name": "항목", "value": "담당자" },
                        { "name": "내용", "value": "서강대학교산학협력단" }
                    ]
                },
                {
                    "cells": [
                        { "name": "항목", "value": "이메일" },
                        { "name": "내용", "value": "tlo@sogang.ac.kr" }
                    ]
                },
                {
                    "cells": [
                        { "name": "항목", "value": "연락처" },
                        { "name": "내용", "value": "02-3274-4863" }
                    ]
                }
            ]
        }
    ]
}
