{"name":"양지훈","email":"jihuny@sogang.ac.kr","introduce":"사회적 문제 해결 AI 전문가","keywords":["기술이전","기계학습","추천시스템","강화학습","이상탐지","딥러닝","데이터증강","인공지능","사이버보안","의료AI","데이터프라이버시","컴퓨터비전","시계열분석","이미지생성","스마트팩토리"],"skills":["인공지능","데이터 과학","딥러닝","머신러닝","강화학습","시계열 데이터 분석","멀티모달 데이터 처리","추천 시스템","컴퓨터 비전","그래프 기반 기계학습","네트워크 분석","데이터 마이닝","정밀의료 인공지능","데이터 증강","이상 탐지"],"cards":[{"type":"text","name":"소개","data":"양지훈 교수는 서강대학교 컴퓨터공학과에서 인공지능 및 데이터 과학 분야를 이끌고 있는 전문가입니다. 사회적 문제 해결에 기여하는 실용적인 AI 모델 개발에 중점을 두며, 문자메시지 기반 스미싱 판별, 온라인 그루밍 위험성 탐지, 딥러닝 기반 고해상도 이미지 생성 등 다양한 연구 과제를 성공적으로 수행하였습니다. 교수님의 연구는 딥러닝, 머신러닝, 강화학습, 시계열 데이터 분석, 멀티모달 데이터 처리 및 추천 시스템 등 광범위한 인공지능 핵심 기술을 아우릅니다. 이러한 연구는 데이터 분석 역량을 기반으로 하며, 다수의 국내외 학술 논문 발표와 특허 등록으로 그 우수성을 인정받고 있습니다. 양지훈 교수는 미래 기술 발전에 지속적으로 기여하고 있습니다."},{"type":"table","name":"소속 정보","data":[{"cells":[{"name":"소속","value":"서강대학교"}]},{"cells":[{"name":"학과","value":"생명과학과"}]},{"cells":[{"name":"직책","value":"교수"}]},{"cells":[{"name":"사무실 번호","value":"027058408"}]},{"cells":[{"name":"이메일","value":"jihuny@sogang.ac.kr"}]},{"cells":[{"name":"연구자 홈페이지","value":"https://sc.sogang.ac.kr/microb/1682.html"}]},{"cells":[{"name":"연구실","value":"AI 연구실"}]},{"cells":[{"name":"연구실 홈페이지","value":"http://ai.sogang.ac.kr/"}]}]},{"type":"text","name":"연구분야: 인공지능 및 데이터 과학 응용","data":"본 연구실은 인공지능(AI) 및 데이터 과학 분야를 선도하며 사회적 문제 해결에 기여하는 실용적인 AI 모델 개발에 중점을 두고 있습니다. 딥러닝, 머신러닝, 강화학습, 시계열 데이터 분석, 멀티모달 데이터 처리 및 추천 시스템 등 광범위한 인공지능 핵심 기술을 활용하여 복잡한 데이터를 심층적으로 분석하고 혁신적인 솔루션을 제시합니다. 구체적으로, 문자메시지 내용 기반 스미싱 판별 AI모델 연구, 소셜네트워크에서의 온라인 그루밍 위험성 자가탐지 기술 개발을 통해 사이버 보안 분야의 위협을 효과적으로 줄이는 데 기여하고 있습니다. 또한, 딥러닝 기반의 고해상도 이미지 생성 기술과 비디오 이해를 위한 데이터 수집 및 보정 자동화 시스템 개발을 통해 컴퓨터 비전 분야의 난제를 해결하고 있습니다. 데이터 증강, 이상 탐지, 시계열 예측 등 다양한 기반 기술 연구를 통해 인공지능 모델의 성능과 신뢰성을 지속적으로 향상시키고 있으며, 이를 통해 금융, 제조, 헬스케어 등 다양한 산업 분야에서 실질적인 가치를 창출하고 있습니다. 본 연구는 다수의 국내외 학술 논문 발표와 특허 등록으로 그 우수성을 입증하고 있으며, 미래 기술 발전에 핵심적인 역할을 수행합니다."},{"type":"text","name":"연구분야: 그래프 기반 기계학습 및 네트워크 분석","data":"본 연구실은 복잡한 데이터 간의 관계를 분석하고 예측하는 데 필수적인 그래프 기반 기계학습 및 네트워크 분석 분야를 선도하고 있습니다. 그래프 신경망(GNN), 그래프 임베딩, 네트워크 통합 분석 등 최신 기법을 개발하고 적용하여 생물학적 네트워크, 소셜 네트워크, 교통 네트워크 등 다양한 형태의 연결된 데이터에서 유의미한 패턴을 발견합니다. 특히, '그래프 기반 준지도 학습에서 빠른 낮은 계수 표현 기반 그래프 구축'에 대한 연구는 효율적인 학습 모델 개발에 기여하며, '소셜네트워크에서의 온라인 그루밍 위험성 자가탐지 기술 개발' 과제에서는 소셜 네트워크 데이터 분석을 통해 사회 안전망 강화에 기여했습니다. 또한, 유전자 알고리즘 기반의 경로 탐색 및 재탐색 기술, 분산 유전 알고리즘을 통한 최적화 기법 등 네트워크 최적화 문제 해결에도 집중하고 있습니다. 이러한 연구는 데이터의 구조적 특성을 깊이 이해하고 활용함으로써, 기존 기계학습 방법론으로는 해결하기 어려웠던 문제들에 대한 혁신적인 접근법을 제시합니다. 다수의 국내외 학술 논문 및 특허를 통해 이 분야에서의 독보적인 전문성과 기술력을 인정받고 있으며, 실제 산업 및 사회 문제 해결에 적용 가능한 실질적인 네트워크 분석 솔루션을 제공하고 있습니다."},{"type":"text","name":"연구분야: 바이오메디컬 데이터 마이닝 및 정밀의료 인공지능","data":"본 연구실은 방대한 바이오메디컬 데이터를 마이닝하고 정밀의료를 위한 인공지능 기술을 개발하는 데 주력하고 있습니다. 유전체, 임상 정보, 의료 영상, 전자의무기록(EMR) 등 다차원적인 바이오 데이터를 통합적으로 분석하여 질병의 조기 진단, 예후 예측, 개인 맞춤형 치료 전략 수립을 위한 핵심 기술을 제공합니다. 특히, 암(유두 신장암, 투명 세포 신장암)과 알츠하이머 같은 난치성 질환의 생존 특이 유전자 발굴, 질병 위험 예측 및 진단 인공지능 모델 개발에서 탁월한 성과를 보이고 있습니다. '인체유래물은행의 데이터 마이닝을 통한 생물정보 활용 시스템 구축', '정밀의학 실현을 위한 난치성신장암 은행', '수정체 혼탁양상과 바이오인포매틱스를 이용한 알츠하이머 예측'과 같은 다수의 국가 및 공동 연구 과제를 수행하며 관련 기술의 실증과 고도화를 이끌었습니다. 시계열 데이터 분석을 통한 뇌졸중 환자의 재활 수준 예측, 유전자 유사도 기반 암 관련 유전자 식별 등 심층적인 데이터 마이닝 기법을 의료 분야에 성공적으로 적용하고 있습니다. 본 연구를 통해 미래 의료 시스템의 혁신을 주도하고, 환자 맞춤형 정밀의료 실현에 기여하며 국민 건강 증진에 이바지하고 있습니다."},{"type":"table","name":"경력","data":[{"cells":[{"name":"내용","value":"서강대학교 컴퓨터공학과 교수 재직"}]},{"cells":[{"name":"내용","value":"AT&T 연구소 선임 연구원 역임"}]},{"cells":[{"name":"내용","value":"벨 연구소 (Bell Labs) 연구원 역임"}]},{"cells":[{"name":"내용","value":"뉴욕주립대학교 (SUNY) 스토니브룩 컴퓨터공학과 조교수 역임"}]}]},{"type":"table","name":"학력","data":[{"cells":[{"name":"학위","value":"박사"},{"name":"학과","value":"컴퓨터공학과"},{"name":"학교","value":"USC"}]},{"cells":[{"name":"학위","value":"석사"},{"name":"학과","value":"컴퓨터공학과"},{"name":"학교","value":"USC"}]},{"cells":[{"name":"학위","value":"학사"},{"name":"학과","value":"전자계산학과"},{"name":"학교","value":"연세대학교"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"담당자","value":"서강대학교산학협력단"}]},{"cells":[{"name":"이메일","value":"tlo@sogang.ac.kr"}]},{"cells":[{"name":"연락처","value":"02-3274-4863"}]}]},{"type":"text","name":"보유 기술","data":""}]}