{
    "name": "박석",
    "email": "spark@sogang.ac.kr",
    "introduce": "데이터 프라이버시 및 보안 연구 선도자",
    "keywords": [
        "공간 데이터베이스",
        "차분 프라이버시",
        "위치정보",
        "데이터 처리",
        "XML 데이터베이스",
        "질의 처리",
        "웹 어플리케이션",
        "인공지능",
        "데이터 마이닝",
        "시공간 정보",
        "데이터 프라이버시",
        "클러스터링",
        "개인정보보호",
        "교통망",
        "빅데이터"
    ],
    "skills": [
        "데이터 프라이버시",
        "차분 프라이버시",
        "데이터 비식별화",
        "접근 제어",
        "데이터 보안",
        "공간 데이터베이스",
        "위치 기반 서비스",
        "시공간 데이터 처리",
        "빅데이터 처리",
        "스트리밍 데이터 처리",
        "데이터 마이닝",
        "K-평균 클러스터링",
        "질의 처리 알고리즘"
    ],
    "cards": [
        {
            "type": "table",
            "name": "소속 정보",
            "data": [
                {
                    "cells": [
                        { "name": "소속", "value": "서강대학교" },
                        { "name": "부서", "value": "컴퓨터공학과" },
                        { "name": "직책", "value": "교수" }
                    ]
                }
            ]
        },
        {
            "type": "links",
            "name": "연락처",
            "data": [
                { "name": "이메일", "href": "mailto:spark@sogang.ac.kr" },
                { "name": "사무실 번호", "href": "02-715-2234" },
                {
                    "name": "연구자 홈페이지",
                    "href": "https://cs.sogang.ac.kr/cs/cs04_3_7.html"
                },
                {
                    "name": "연구실 홈페이지",
                    "href": "http://dblab.sogang.ac.kr/"
                }
            ]
        },
        { "type": "text", "name": "연구실", "data": "데이터베이스 연구실" },
        {
            "type": "text",
            "name": "데이터 프라이버시 및 비식별화 기술",
            "data": "본 연구 분야는 웹상의 대량 데이터에서 개인정보 노출 취약점을 분석하고, 차분 프라이버시(Differential Privacy)를 포함한 다양한 기법을 활용하여 개인정보를 보호하는 데 중점을 둡니다. 현대 사회에서 데이터 활용이 증가하면서 발생하는 개인정보 유출 및 오용 문제를 해결하기 위한 비식별화, 접근 제어, 안전한 데이터 처리 기술 개발에 선도적인 역할을 수행하고 있습니다. 특히, 데이터 마이닝 시스템에서 차분 프라이버시를 만족하는 히스토그램을 생성하고 이를 기반으로 K-평균 클러스터링을 실행하는 방법론을 제시하여 데이터 분석의 유용성을 유지하면서도 강력한 프라이버시 보호를 가능하게 합니다. 또한, 시간 간격 데이터 공개 시 빈도 행렬에 차분 프라이버시를 적용하여 데이터를 안전하게 공개하는 기술을 개발하였으며, 다수의 사용자가 존재하는 환경에서 개인 위치 정보를 익명화하여 보호하는 장치 및 방법 특허를 보유하고 있습니다. 이러한 연구 성과는 공공 및 민간 분야에서 데이터 생태계의 신뢰성을 확보하고 개인정보 보호를 강화하는 데 필수적인 기반 기술을 제공합니다. 스트리밍 데이터 환경에서 차분 프라이버시를 적용한 빈발 항목 집합 갱신 지연 기법, 제한된 프라이버시 예산 내에서 효율적인 질의 처리를 위한 배치 전략 등 데이터 프라이버시 분야의 최신 기술 개발에도 적극적으로 기여하고 있습니다. 본 연구는 다양한 데이터 환경에서의 프라이버시 침해 위협에 대응하고, 개인의 사생활을 보호하면서도 데이터의 가치를 최대한 활용할 수 있는 방안을 모색하여, 디지털 전환 시대의 핵심적인 사회적 가치를 창출하고 있습니다. 이 기술들은 금융, 의료, 공공 서비스 등 민감한 개인정보를 다루는 모든 분야에 적용 가능하며, 데이터 기반 비즈니스 모델의 지속 가능성을 높이는 데 기여할 수 있습니다."
        },
        {
            "type": "text",
            "name": "공간 데이터베이스 및 위치 기반 서비스",
            "data": "본 연구 분야는 경로 탐색, 위치 기반 추천, 개인 위치 정보보호 등 위치 정보를 활용한 다양한 서비스를 지원하기 위한 인덱싱 기법 및 질의 처리 알고리즘 개발에 집중합니다. 특히, 방대한 시공간 데이터를 효율적으로 저장, 관리, 분석하고, 이를 통해 사용자에게 맞춤형 위치 기반 서비스를 제공하는 핵심 기술을 개발합니다. 개인정보가 보호된 공간 분할 기법 기반의 유클리드 공간 질의처리 기법을 연구하여 민감한 위치 정보의 프라이버시를 보장하면서도 정확한 공간 질의 결과를 제공하는 데 기여했습니다. 또한, 도로 교통망 환경에서 G-트리 구조를 이용한 단일 그룹 콜렉티브 여행 질의 처리 장치 및 방법 특허를 통해 복잡한 교통 환경에서 최적의 이동 경로 및 그룹 이동 솔루션을 제공하는 기술을 선보였습니다. 시공간 아카이브의 설계 및 시스템 연구와 시공간 정보 저장장치 검색용 유사의미 정보 색인 방법 특허는 시간, 위치, 유사의미를 포괄하는 통합 색인 구조를 통해 방대한 시공간 데이터를 빠르고 정확하게 검색할 수 있도록 지원합니다. 'Nearly most influential location selection with differentially private user locations in a road network'와 같은 논문을 통해 차분 프라이버시가 적용된 사용자 위치 정보를 기반으로 가장 영향력 있는 위치를 선정하는 고도화된 분석 기법을 제시하는 등, 위치 기반 서비스의 정확성과 프라이버시 보호라는 두 가지 중요한 가치를 동시에 실현하는 데 선도적인 역할을 하고 있습니다. 이러한 연구는 스마트시티, 자율주행, 물류 최적화, 관광 산업 등 다양한 분야에서 혁신적인 위치 기반 서비스를 구현하는 데 필수적인 기반을 제공합니다."
        },
        {
            "type": "text",
            "name": "빅데이터 처리 및 접근 제어",
            "data": "본 연구 분야는 급증하는 대용량 데이터 처리 요구사항을 충족하고 실시간 시스템을 제공하기 위한 스트리밍 데이터 처리 기법과, 자원에 대한 접근 권한을 허가하거나 금지하는 접근 제어 기법에 대한 연구를 수행합니다. 빅데이터 환경에서 데이터의 효율적인 수집, 저장, 분석 및 활용을 위한 핵심 기술을 개발하며, '빅데이터 활용을 위한 창의적 기반기술 연구인력 양성' 과제를 통해 관련 전문가 양성에도 기여하고 있습니다. 특히, K-평균 클러스터링 기반의 데이터 마이닝 시스템 및 방법을 통해 차분 프라이버시를 만족하는 히스토그램을 생성하고 이를 활용하여 대규모 데이터 클러스터링을 안전하게 수행하는 기술을 개발했습니다. 접근 제어 측면에서는 사용자 역할 기반의 접근 제어뿐만 아니라, 이종 디바이스와 주변 상황을 인식하여 동적이고 세밀한 수준의 접근 제어를 수행하는 연구를 진행하고 있습니다. 이는 데이터 보안을 강화하고 시스템의 무결성을 보장하는 데 필수적입니다. 또한, '다중 웹 앱 버전 관리를 위한 보안 접근제어 기술'과 같은 산학공동 과제를 통해 실제 산업 현장의 요구에 맞는 보안 솔루션을 개발하는 데 참여했습니다. 실시간 스트리밍 데이터 처리 기술은 IoT, 금융 거래, 로그 분석 등 실시간 의사결정이 중요한 분야에 적용될 수 있으며, 동적인 접근 제어 기술은 클라우드 환경, 모바일 환경 등 다양한 IT 인프라에서 민감 정보 보호에 중요한 역할을 합니다. 이러한 연구는 대규모 데이터 환경에서의 정보 보안과 효율적인 데이터 활용을 동시에 가능하게 하여, 기업의 디지털 전환과 새로운 비즈니스 가치 창출에 핵심적인 기여를 할 수 있습니다."
        },
        {
            "type": "table",
            "name": "경력정보",
            "data": [
                {
                    "cells": [
                        { "name": "기간", "value": "1992.03.01 ~ 재직중" },
                        { "name": "기관", "value": "서강대학교" },
                        { "name": "직책", "value": "컴퓨터공학과 교수" }
                    ]
                },
                {
                    "cells": [
                        { "name": "기간", "value": "1996.09.01 ~ 1997.08.01" },
                        { "name": "기관", "value": "미국 미시간 대학교" },
                        { "name": "직책", "value": "컴퓨터과학과 방문교수" }
                    ]
                }
            ]
        },
        {
            "type": "table",
            "name": "학력",
            "data": [
                {
                    "cells": [
                        { "name": "학위", "value": "박사" },
                        { "name": "기관", "value": "퍼듀대학교" },
                        { "name": "전공", "value": "컴퓨터과학과" }
                    ]
                },
                {
                    "cells": [
                        { "name": "학위", "value": "석사" },
                        { "name": "기관", "value": "퍼듀대학교" },
                        { "name": "전공", "value": "컴퓨터과학과" }
                    ]
                },
                {
                    "cells": [
                        { "name": "학위", "value": "학사" },
                        { "name": "기관", "value": "서강대학교" },
                        { "name": "전공", "value": "전자계산학과" }
                    ]
                }
            ]
        },
        {
            "type": "table",
            "name": "서강대학교 산학협력단 문의처",
            "data": [
                {
                    "cells": [
                        { "name": "담당자", "value": "서강대학교산학협력단" },
                        { "name": "이메일", "value": "tlo@sogang.ac.kr" },
                        { "name": "연락처", "value": "02-3274-4863" }
                    ]
                }
            ]
        }
    ]
}
