{"name":"서용덕","email":"yndk@sogang.ac.kr","introduce":"AI, 비전, XR 융합 연구 전문가","keywords":["기계학습","3D복원","딥러닝","데이터분석","인공지능","미디어아트","비전검사","폴더블디스플레이","컴퓨터비전","카메라캘리브레이션","패턴인식","이미지처리","XR","한글교육AI","증강현실"],"skills":["컴퓨터 비전","인공지능(AI)","딥러닝","기계학습","3D 모델링","3D 재구성","XR 기술","증강현실(AR)","이미지 처리","패턴 인식","카메라 캘리브레이션","데이터 분석","자동 결함 검출","GPU 기반 이미지 처리","문화유산 디지털화","몰입형 콘텐츠 개발","AI 기반 한글 교육 시스템"],"cards":[{"type":"table","name":"소속 및 직책","data":[{"cells":[{"name":"소속","value":"서강대학교"},{"name":"부서","value":"글로벌한국학과"},{"name":"직책","value":"교수"},{"name":"사무실 번호","value":"027058896"}]}]},{"type":"links","name":"개인 웹사이트","data":[{"name":"연구자 홈페이지","href":"https://viplab.sogang.ac.kr/viplab/"},{"name":"연구실 VIP LAB 홈페이지","href":"https://viplab.sogang.ac.kr/viplab/index.html"}]},{"type":"table","name":"경력","data":[{"cells":[{"name":"기관","value":"서강대학교 글로벌한국학부"},{"name":"기간","value":"정보 없음"},{"name":"직책","value":"교수"}]},{"cells":[{"name":"기관","value":"ETRI"},{"name":"기간","value":"2002.10 - 2003. 2."},{"name":"직책","value":"Invited Researcher"}]},{"cells":[{"name":"기관","value":"POSTECH"},{"name":"기간","value":"2001.5.1 - 2002.9."},{"name":"직책","value":"BK21 Researcher in Image Information Processing Lab"}]}]},{"type":"table","name":"학력","data":[{"cells":[{"name":"학교","value":"경북대학교 공과대학"},{"name":"학위","value":"공학사"},{"name":"년도","value":"1992"}]},{"cells":[{"name":"학교","value":"포항공과대학"},{"name":"학위","value":"공학석사"},{"name":"년도","value":"1994"}]},{"cells":[{"name":"학교","value":"포항공과대학"},{"name":"학위","value":"공학박사"},{"name":"년도","value":"2000"}]}]},{"type":"text","name":"연구분야: 컴퓨터 비전, 3D 재구성 및 XR 기술","data":"본 연구실은 컴퓨터 비전, 3D 재구성(복원 및 모델링), 증강현실(AR) 및 확장현실(XR) 기술 분야에서 선도적인 연구를 수행하고 있습니다. 이미지 처리, 패턴 인식, 카메라 캘리브레이션 등 핵심 컴퓨터 비전 기술을 기반으로 현실 세계의 복잡한 3D 정보를 정확하게 획득하고 재구성하는 데 주력합니다. 특히, 다시점 구조광 및 스테레오 영상 기반의 고해상도 3D 정합 기술을 개발하여 문화재 복원, 정밀 측정, 산업 검사 등 다양한 응용 분야에서 혁신적인 솔루션을 제공합니다. 연구실은 딥러닝 기반 3D 모델링 알고리즘과 AR/VR 환경에서의 실감형 콘텐츠 구현을 위한 XR 플랫폼 연구에 강점을 가지고 있습니다. 다중 카메라 시스템을 활용한 효율적인 캘리브레이션 기술은 가상 시점 합성 및 3차원 형상 복원의 정확도를 높이는 데 기여하며, 이는 자율주행, 로봇 비전, 스마트 팩토리 등 첨단 산업 분야에 필수적인 기술입니다. 또한, GPU를 기반으로 한 고속 대응점 탐색 기술(특허 보유)을 통해 대규모 데이터 처리 효율을 극대화하여 실시간 응용 가능성을 확장하고 있습니다. 이러한 연구는 고정밀 3D 스캐닝, 실감형 시뮬레이션, 지능형 로봇 시스템 개발에 활용될 수 있으며, 제조업의 품질 관리, 문화유산 디지털화, 미래 교육 및 엔터테인먼트 산업에 핵심적인 가치를 창출합니다. 다양한 산학협력 과제를 통해 실질적인 문제 해결에 기여하고 있으며, 지속적인 기술 혁신을 통해 차세대 시각 기술을 선도합니다."},{"type":"text","name":"연구분야: AI 기반 산업 비전 및 데이터 분석","data":"본 연구실은 인공지능(AI)과 딥러닝 기술을 활용하여 산업 현장의 비전 검사 및 복잡한 데이터 분석 문제를 해결하는 데 중점을 둡니다. 특히, 대량의 이미지 및 센서 데이터를 기반으로 한 자동 결함 검출 시스템과 효율적인 데이터 처리 알고리즘 개발에 핵심 역량을 집중하고 있습니다. 딥러닝(Deep Learning) 및 통계적 기계학습(Statistical Machine Learning) 기법을 적용하여 OLED 패널과 같은 정밀 디스플레이의 미세 결함을 자동으로 검출하고, RCNN(Region-based Convolutional Neural Network) 기반의 결함 분류 및 위치 파악 기술을 고도화하여 생산 품질 향상에 기여합니다. 연구실은 이미지 생성 모델을 활용한 패턴 결함 데이터 증강 연구를 통해 데이터 부족 문제를 해결하고, 강인한 데이터 처리 알고리즘 개발을 통해 예측 불가능한 산업 환경 변화에도 안정적으로 작동하는 시스템을 구축합니다. 또한, SD Map 도로 속성 생성을 위한 딥러닝 알고리즘 개발이나 폴더블 디스플레이의 자동 컨택 정렬 시스템과 같은 실제 산업 과제를 수행하며 AI 기술의 실질적인 적용 가능성을 증명해왔습니다. 이러한 연구는 스마트 팩토리, 자율주행, 정밀 제조, 품질 관리 등 다양한 산업 분야에서 생산 효율을 극대화하고 비용을 절감하는 핵심 기술로 활용됩니다. 복잡한 데이터를 지능적으로 분석하고 시각 정보를 정교하게 해석하는 본 연구실의 기술은 기업의 경쟁력을 강화하고 미래 산업을 선도하는 데 크게 기여할 것입니다."},{"type":"text","name":"연구분야: 미디어아트 및 문화 기술 융합","data":"본 연구실은 컴퓨터 비전, 인공지능, 증강현실(AR) 등의 첨단 기술을 미디어아트 및 문화 콘텐츠 분야에 융합하여 새로운 사용자 경험과 예술적 가치를 창출하는 연구를 진행합니다. 딱지본 표지 이미지와 같은 전통 문화 요소를 활용하여 가상 공간을 생성하고, 이를 통해 문화재의 디지털 아카이빙 및 몰입형 전시 콘텐츠를 개발합니다. 또한, 다중이용자 실시간 참여형 XR 전시 플랫폼 연구개발을 통해 예술과 과학 기술의 경계를 허물고, 관람객과의 능동적인 상호작용을 통한 새로운 형태의 예술적 표현을 모색하고 있습니다. 연구실은 모바일 증강현실 기반의 인터랙티브 미디어아트 작품 구현과 컴퓨터 비전 기술을 접목한 창의적 표현 저작 도구 개발에 강점을 가지고 있습니다. 사용자의 제스처나 감정 변화에 반응하는 동적인 시각 효과를 구현하고, 이를 통해 관객이 직접 예술 작품의 일부가 되는 참여형 예술 경험을 제공합니다. 최근에는 외국인의 한국문화 접근성 향상을 위한 AI 기반 맞춤형 한글 교육 시스템 개발에도 참여하여, 기술이 문화 교육과 융합될 때 창출될 수 있는 사회적 가치에 주목하고 있습니다. 이러한 융합 연구는 디지털 문화유산의 보존 및 활용, 몰입형 교육 콘텐츠 개발, 그리고 차세대 엔터테인먼트 산업의 혁신을 이끌어낼 잠재력을 가지고 있습니다. 기술과 예술, 문화의 접점에서 새로운 가능성을 탐구하며, 인간 중심의 기술 발전을 통해 문화의 폭을 확장하고 사회적 소통을 증진하는 데 기여하고 있습니다."},{"type":"links","name":"서강대학교 문의처","data":[{"name":"담당자: 서강대학교산학협력단","href":"mailto:tlo@sogang.ac.kr"},{"name":"연락처: 02-3274-4863","href":"tel:02-3274-4863"}]}]}