{"name":"이희우","email":null,"introduce":"반도체/에너지 연구자","keywords":["리튬이온","고분자 막","나노복합막","양성자 전도","유기 태양전지","유-무기 하이브리드","연료전지","반도체 소재","나노복합체","재료 개발","센서","초저유전재료","막 공정","태양전지","고분자 전해질"],"skills":[],"cards":[{"type":"text","name":"AI 요약","data":"서강대학교 화공생명공학과 이희우 교수는 차세대 반도체용 초저유전 재료, 고분자 전해질 및 연료전지 분야의 선도적인 연구자입니다. 이 교수는 고강도·고효율 초저유전 소재 개발을 통해 반도체 성능 향상에 기여하고 있으며, 혁신적인 고분자 전해질 및 나노 복합막 기술로 연료전지 및 이차전지의 효율을 극대화하고 있습니다. 그의 연구는 수처리, 태양전지 등 다양한 첨단 소재 분야로 확장되며, 다수의 국책 과제 수행과 SCI급 논문 발표, 특허 등록으로 그 우수성을 입증하고 있습니다. 이희우 교수의 지속적인 연구는 미래 핵심 산업의 발전에 크게 기여할 것입니다."},{"type":"text","name":"차세대 반도체용 고강도 초저유전 재료 개발","data":"본 연구실은 차세대 시스템 반도체의 성능 향상과 고집적화를 위한 고강도 초저유전 재료 개발에 집중하고 있습니다. 반도체 층간 절연막의 핵심 요구 사항인 낮은 유전율과 우수한 기계적 강도를 동시에 만족시키기 위해 혁신적인 접근법을 활용합니다. 특히, 열처리 시 잔여물이 남지 않고 완전 열분해되는 환형 유기 폴리올 기반의 반응형 기공형성제를 개발하여, 유전상수 2.09, 탄성률 8.15 GPa, 경도 1.4 GPa에 이르는 고강도 초저유전 박막을 성공적으로 구현했습니다. 이 박막은 1~3nm 크기의 기공이 균일하게 분포되어 2.12~2.4의 낮은 유전율과 10.5~19 GPa의 높은 기계적 탄성률을 동시에 달성합니다. 이러한 기술은 구리 배선용 층간 절연재료 및 50nm급 초저유전체 개발 등 다양한 국책 과제를 통해 검증되었으며, 차세대 반도체 공정 특성 개선에 필수적인 고효율 솔루션을 제공하여 반도체 산업 발전에 크게 기여하고 있습니다. 본 연구는 나노기공 초저유전 물질 제조를 위한 기공형성 수지 개발 및 고온 오존 처리 공정을 포함하며, 지속적으로 반도체 성능 극대화를 위한 초저유전 소재 기술을 선도하고 있습니다."},{"type":"text","name":"고효율 고분자 전해질 및 차세대 에너지 저장 기술","data":"본 연구실은 고분자 전해질 및 나노 복합막 기술을 통해 연료전지와 리튬 이차전지의 효율을 극대화하는 데 주력하고 있습니다. 특히, 기존 고분자 전해질 막의 낮은 이온전도도, 수분 팽윤, 고가 촉매 의존성 등의 한계를 극복하는 혁신적인 솔루션을 개발했습니다. 캐스팅 과정 중 극성 용매의 상분리 효과를 활용하여 이온 채널 크기를 정밀하게 제어함으로써, 물성 저하 없이 이온전도도를 최대 150% 향상시켰습니다. 또한, 다면체 올리고머형 실세스퀴옥산(POSS) 기반 음이온 공여체를 나노채널에 도입하여 음이온 교환막 연료전지의 이온전도도를 18% 개선(73 mS/cm)하고, 고가 백금 촉매 없이 고성능 연료전지를 구현하는 데 성공했습니다. 습도 변화에 강한 고성능 연료전지를 위해 말단 아민기를 포함하는 POSS 나노입자를 활용한 탄화수소계 양성자 전도성 나노복합막을 개발하여, 고습 및 저습 환경 모두에서 이온전도도 향상과 우수한 기계적 강도를 제공합니다. 이러한 성과는 전고상 고분자 전해질의 리튬이온 전도 향상, 고온용 나노복합전해질막 개발, DMFC용 고분자 복합전해질 등 다양한 국책 과제를 통해 입증되었으며, 차세대 에너지 저장 및 변환 시스템의 상용화를 앞당기는 데 기여하고 있습니다."},{"type":"text","name":"첨단 유-무기 하이브리드 소재 및 다기능성 막 공정","data":"본 연구실은 반도체 및 에너지 분야를 넘어 수처리, 태양전지, 센서 등 다양한 첨단 산업에 적용 가능한 유-무기 하이브리드 소재 및 다기능성 막 공정 기술을 연구합니다. 특히, 유기 및 무기 나노 재료의 장점을 결합하여 고성능, 고안정성을 갖는 복합 재료를 개발하고 있습니다. 수처리 분야에서는 첨단 기능성 막 및 막 공정 시스템 개발을 통해 효율적인 오염물질 제거 및 재활용 기술을 구현하고 있으며, 이는 지속 가능한 환경 기술 발전에 필수적인 역할을 합니다. 또한, 스마트카드용 유기 태양전지 개발을 통해 유연하고 투명한 차세대 에너지 소자 구현 가능성을 제시하고 있으며, 양자점으로 도핑된 고분자 전해질을 활용한 염료감응형 태양전지 기술은 효율 향상에 크게 기여합니다. 유-무기 하이브리드형 차세대 고무 가황제 개발 및 유기반도체 트랜지스터용 유전 재료 연구를 통해 다양한 전자 소자의 성능 향상에 기여하고 있습니다. 본 연구는 나노 복합체 제조 기술, 고내열성 비할로겐 난연제 개발 등 광범위한 재료 개발 프로젝트를 수행하며, 유기-무기 나노 하이브리드 기술을 이용한 70NM급 후공정 집적 기술 개발에도 참여하여 미래 산업의 핵심 소재 기술 혁신을 주도하고 있습니다."},{"type":"table","name":"학력","data":[{"cells":[{"name":"학교","value":"서울대학교"},{"name":"학위","value":"공학사"},{"name":"연도","value":"1978"}]},{"cells":[{"name":"학교","value":"한국과학기술원"},{"name":"학위","value":"공학석사"},{"name":"연도","value":"1980"}]},{"cells":[{"name":"학교","value":"The University of Connecticut"},{"name":"학위","value":"공학박사"},{"name":"연도","value":"1987"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]}]}