{
    "name": "차혁진",
    "email": "tlo@sogang.ac.kr",
    "introduce": "난치성 질환 극복 및 인류 건강 증진 연구",
    "keywords": [
        "신경줄기세포",
        "약물개발",
        "줄기세포",
        "바이오마커",
        "iPSC",
        "항암제",
        "면역세포",
        "오가노이드",
        "정밀의료",
        "질환모델",
        "재생의료",
        "암치료",
        "테라토마",
        "유전자편집",
        "폐암"
    ],
    "skills": [
        "줄기세포 연구",
        "유전자 편집 기술",
        "질환 모델링",
        "항암 연구",
        "재생의학",
        "신약 개발",
        "오가노이드 구축",
        "정밀 유전자 치료",
        "전사체 분석",
        "면역세포 치료",
        "암줄기세포 연구"
    ],
    "cards": [
        {
            "type": "text",
            "name": "줄기세포 기반 재생의학 및 유전자 편집 기술",
            "data": "본 연구실은 줄기세포 연구를 기반으로 한 재생의학 분야의 선도적인 역할을 수행하고 있습니다. 특히, 인간 배아 및 유도만능줄기세포(iPSC)의 전능성을 제어하고 활용하는 기술 개발에 중점을 둡니다. 줄기세포의 생존, 증식, 분화 과정을 조절하는 신호전달 네트워크를 심층적으로 이해하며, 최첨단 유전자 편집 기술을 적용하여 질병 모델 구축 및 유전 질환 치료 가능성을 탐색합니다. 미분화 줄기세포의 안전성을 확보하고, 세포 치료 시 발생할 수 있는 테라토마 형성 가능성을 원천적으로 억제하는 기술 개발에 주력하여 임상 적용의 안전성을 높이고 있습니다. 연구실은 줄기세포의 병원성 돌연변이를 교정하고, 조직 손상 시 줄기세포의 역분화를 유도하여 손상된 조직을 재생하는 생체 내 리프로그래밍 기술을 연구합니다. 이를 통해 심혈관 질환, 신경 퇴행성 질환 등 난치성 질환 치료를 위한 혁신적인 세포 치료제 개발 가능성을 열고 있습니다. 또한, 인간 다중 장기 어셈블로이드 구축을 통해 장기 간 상호작용을 규명하고 질환 치료 제어 기술을 발전시켜, 실제 인체 환경을 모사한 정밀한 질환 모델을 제시합니다. 이러한 연구는 줄기세포 치료제의 상용화를 가속화하고, 기존 치료법으로는 해결하기 어려웠던 난치병 치료에 새로운 대안을 제공하며, 궁극적으로 인류의 건강 증진과 삶의 질 향상에 기여하는 것을 목표로 합니다. 안전하고 효과적인 줄기세포 기반 재생의학 기술을 통해 미래 의료 패러다임을 변화시키는 데 핵심적인 역할을 수행하고 있습니다."
        },
        {
            "type": "text",
            "name": "유전 질환 모델링 및 정밀 유전자 치료 기술",
            "data": "본 연구실은 유전성 난치 질환 극복을 위한 혁신적인 질환 모델링 및 정밀 유전자 치료 기술 개발에 집중하고 있습니다. 특히, 최첨단 유전자 편집 기술을 활용하여 환자 유래 유도만능줄기세포(iPSC)로부터 다양한 유전 질환 모델을 구축하고, 이를 통해 질병의 분자 메커니즘을 심층적으로 규명합니다. 허친슨 길포오드 조로증 증후군 및 GNE 근질환과 같은 특정 유전성 질환에 대한 정밀 염기 교정 기반의 유전자 치료제를 개발하여, 근본적인 치료 가능성을 제시합니다. 연구는 단순히 질병을 모사하는 것을 넘어, 구축된 질환 모델에서 기능 회복을 위한 고급 유전자 편집 도구의 효과를 검증하고 최적화하는 데까지 나아갑니다. 인간 다중 장기 어셈블로이드(Organoid)를 구축하여 뇌세포-뇌조직-신체기관 간의 복잡한 상호작용을 규명하고, 이를 기반으로 질환 치료 제어 기술을 개발하여 전신 질환에 대한 통합적인 치료 전략을 모색합니다. 또한, 생체 내 리프로그래밍 기술을 활용하여 장기별 ABC 유사세포 형성과 제어 기술을 연구함으로써, 손상된 장기의 기능 회복을 위한 새로운 패러다임을 제시합니다. 이러한 연구는 유전 질환 진단 및 치료의 정확성을 높이고, 개인 맞춤형 정밀 의료 시대를 앞당기는 데 중요한 기여를 합니다. 다양한 유전성 질환 모델 개발 및 유전자 치료제 연구를 통해 난치병 환자들에게 희망을 제공하며, 미래 의료 기술 발전의 핵심 동력으로 작용할 것입니다."
        },
        {
            "type": "text",
            "name": "암 질환 진단 및 치료를 위한 혁신 신약 개발",
            "data": "본 연구실은 암 질환의 진단 및 치료제 개발을 위한 심도 깊은 항암 연구를 수행하고 있습니다. 특히 폐암 및 신경교종과 같은 다양한 암 질환의 특성을 분석하고, 암세포의 전이 및 항암제 내성 기전을 규명하는 데 주력합니다. 암 세포와 주변 미세환경 간의 상호작용을 이해하고, 이를 제어할 수 있는 새로운 표적 단백질을 발굴하여 혁신적인 항암제 개발에 기여하고 있습니다. NGS(Next Generation Sequencing) 기반의 전사체 분석을 통해 신규 약물 작용점을 발굴하는 연구도 활발히 진행 중입니다. 항암 면역세포 디스커버리 플랫폼 기술 개발 연구를 통해 면역 치료 효과를 극대화할 수 있는 전략을 모색하며, 이는 차세대 항암 치료법 개발의 핵심 동력이 됩니다. 또한, 종양 미세환경 연구를 통해 암의 성장과 전이를 촉진하는 요인을 밝혀내고, 이를 억제할 수 있는 치료 전략을 수립합니다. 암줄기세포 특성을 갖는 신경줄기세포 모델을 이용하여 암 발생 과정 연구 및 암치료제 후보물질 스크리닝 방법을 개발하여 신약 개발의 효율성을 높이고 있습니다. 이러한 연구는 암 진단 및 치료의 정확도를 향상시키고, 기존 항암제의 한계를 극복하는 새로운 치료 패러다임을 제시합니다. 다양한 암 질환에 대한 맞춤형 치료 전략을 제공하고, 환자의 생존율과 삶의 질을 향상시키는 데 궁극적인 목표를 두고 있습니다."
        },
        {
            "type": "table",
            "name": "문의처",
            "data": [
                {
                    "cells": [
                        { "name": "담당자", "value": "서강대학교산학협력단" },
                        { "name": "이메일", "value": "tlo@sogang.ac.kr" },
                        { "name": "연락처", "value": "02-3274-4863" }
                    ]
                }
            ]
        }
    ]
}
