{"name":"오세용","email":"syoh@sogang.ac.kr","introduce":"유기반도체 소자 전문가","keywords":["디스플레이소재","버퍼층","나노기술","광전효율","유기태양전지","산학협력","유기트랜지스터","바이오기술","광다이오드","페로브스카이트","유기반도체","유기포토디텍터","에너지재료","전자소재","첨단소재"],"skills":["유기전자소자","광전변환 기술","페로브스카이트 태양전지","유기 포토디텍터","유기 트랜지스터","유기반도체 소자 개발","신소재 개발","나노기술","계면 제어"],"cards":[{"type":"text","name":"AI 요약","data":"오세용 서강대학교 화공생명공학전공 교수님은 유기전자소자 및 광전변환 기술 분야의 선도적인 연구자이십니다. 특히 페로브스카이트 태양전지, 고감도 유기 포토디텍터, 유기 발광 트랜지스터 등 차세대 유기반도체 소자 개발에 기여하고 계십니다. 다양한 국책 과제와 산학협력을 통해 신소재 개발 및 소자 효율 향상에 매진하시며, 국내외 학술지에 다수의 논문을 게재하고 관련 특허를 등록하는 등 활발한 연구 활동을 이어가고 계십니다. 교수님의 연구는 미래 전자 산업의 발전에 중요한 초석을 제공하고 있습니다."},{"type":"table","name":"소속 및 연락처","data":[{"cells":[{"name":"항목","value":"소속"},{"name":"내용","value":"서강대학교"}]},{"cells":[{"name":"항목","value":"부서 학과"},{"name":"내용","value":"화공생명공학과"}]},{"cells":[{"name":"항목","value":"직책"},{"name":"내용","value":"교수"}]},{"cells":[{"name":"항목","value":"사무실 번호"},{"name":"내용","value":"027058681"}]},{"cells":[{"name":"항목","value":"이메일"},{"name":"내용","value":"syoh@sogang.ac.kr"}]}]},{"type":"links","name":"연구실","data":[{"name":"광전자 나노소재 및 그린에너지 연구실","href":"https://advpoly.sogang.ac.kr/advpoly/"}]},{"type":"text","name":"연구분야: 페로브스카이트 태양전지 및 고효율 광전변환 기술","data":"본 연구실은 차세대 고효율 에너지 변환 장치인 페로브스카이트 태양전지의 핵심 기술 개발에 주력하고 있습니다. 기존 실리콘 태양전지의 한계를 뛰어넘는 고효율 및 유연성을 목표로, 새로운 페로브스카이트 소재 설계, 소자 구조 최적화, 그리고 장기 안정성 확보에 대한 심도 깊은 연구를 수행합니다. 특히, 고내구성 유기 정공 전달 물질 개발 및 이중 삽입층 구조를 통한 열화 방지 기술은 소자의 안정성을 획기적으로 향상시켰으며, 21.63% 이상의 높은 광전변환 효율을 달성하여 차세대 에너지 기술의 가능성을 입증하고 있습니다. 주요 연구 내용은 페로브스카이트 태양전지의 제조 공정 단축 기술, 다양한 금속 도핑을 통한 성능 향상, 그리고 대량 생산을 위한 페로브스카이트 분말 제조 방법 개발을 포함합니다. 우리는 재료의 합성부터 소자 제작 및 특성 분석에 이르는 전 과정에서 나노기술을 접목하여 계면 제어를 통한 효율 극대화를 추구합니다. 이러한 연구는 첨단 에너지 재료 분야의 혁신을 선도하며, 기존 광전변환 기술의 한계를 극복하고 상업화를 위한 중요한 기반을 마련하고 있습니다. 본 연구를 통해 개발된 페로브스카이트 태양전지 기술은 미래 친환경 에너지 시스템 구축에 필수적인 요소로, 저비용 고효율 태양광 발전 시대를 앞당길 것입니다. 특히 플렉서블 소자로서의 잠재력은 웨어러블 전자기기, 건물 일체형 태양광(BIPV) 등 다양한 응용 분야에서 새로운 시장 가치를 창출할 수 있으며, 관련 산업과의 활발한 산학협력을 통해 기술 상용화를 가속화할 것입니다."},{"type":"text","name":"연구분야: 고감도 유기 포토디텍터 및 첨단 광센서 기술","data":"본 연구실은 다양한 산업 분야에서 요구되는 고감도 광센서 및 이미지 센서 개발을 위해 유기 포토디텍터(OPD) 기술을 심도 깊게 연구하고 있습니다. 특히, 가시광선 영역, 그중에서도 녹색광 파장대(510~570nm)에서 뛰어난 광전효율과 고감도를 발현하는 차세대 유기 포토디텍터 개발에 중점을 둡니다. 이를 위해 새로운 유기 반도체 소재 탐색 및 버퍼층 기술 최적화를 통해 소자의 성능을 극대화하고 있습니다. 주요 연구 성과로는 하프늄옥사이드(HfO2) 초박막을 버퍼층으로 적용하여 녹색광 효율을 기존 대비 3.5배 이상 향상시킨 기술이 있습니다. 이 기술은 전자 차단 및 정공 터널링 효과를 정밀하게 제어함으로써 높은 광응답성과 낮은 암전류를 동시에 달성합니다. 또한, 유무기 하이브리드 구조 및 플렉서블 유기 포토디텍터 개발을 통해 유연 전자 소자 및 웨어러블 센서 분야로의 확장 가능성을 탐색하고 있습니다. 이러한 기술은 고감도 이미지센서용 서브마이크론 픽셀 구현에도 기여합니다. 이러한 고감도 유기 포토디텍터 기술은 스마트폰, 자율주행차, 의료기기, 사물 인터넷(IoT) 등 다양한 분야의 첨단 광센서 시장에 혁신적인 솔루션을 제공할 수 있습니다. 특히, 기존 실리콘 기반 센서의 한계를 보완하며 유연성, 투명성, 저비용 생산 가능성을 바탕으로 차세대 디스플레이 및 바이오센서 분야에서 높은 부가가치를 창출할 것으로 기대됩니다. 관련 기업과의 기술 협력을 통해 상용화를 적극적으로 추진하고 있습니다."},{"type":"text","name":"연구분야: 유기 반도체 기반 차세대 유기 트랜지스터 및 전자소자","data":"본 연구실은 유기 반도체 재료를 활용한 차세대 유기 트랜지스터(OTFT) 및 유기 발광 트랜지스터(OLET) 기술 연구를 선도하고 있습니다. 고성능, 저전력, 유연성을 겸비한 유기 전자소자 개발을 목표로, 나노기술 기반의 소자 구조 설계 및 새로운 유기 반도체 재료 합성에 집중하고 있습니다. 특히, 수직형 유기 트랜지스터 구조를 통해 소자 집적도를 높이고, 나노사이즈의 게이트 오프닝 홀 제어 기술을 통해 전류 스위칭 특성을 획기적으로 개선하고 있습니다. 주요 연구 분야는 N형 및 P형 유기 활성 물질의 개발, 고분자 발광 트랜지스터의 나노구조 계면 제어, 그리고 유기 발광 시스템의 효율 향상 기술을 포함합니다. 우리는 유기 반도체의 전하 이동 특성과 발광 특성을 정밀하게 조절하여 안정적이면서도 고성능을 발휘하는 트랜지스터 소자를 구현합니다. 블록 공중합체의 자기 조립 특성을 이용한 나노 패턴 게이트 전극 기술은 기존 소자 대비 수십 배 이상의 점멸비 향상을 가능하게 하여, 미래 유기 전자 소자의 핵심 기술로 주목받고 있습니다. 이러한 유기 트랜지스터 및 전자소자 기술은 플렉서블 디스플레이, 스마트카드, RFID 태그, 웨어러블 디바이스 등 광범위한 분야에서 차세대 전자 제품의 성능을 향상시키고 새로운 형태의 제품을 가능하게 할 것입니다. 기존의 무기 반도체 소자와의 차별성을 바탕으로 유연하고 투명한 전자기기 구현에 기여하며, 산업체와의 협력을 통해 연구 결과를 실제 제품으로 연결하는 데 힘쓰고 있습니다."},{"type":"text","name":"경력정보","data":"서강대학교 화공생명공학과 교수 (1994~현재) 미국 Cornell 대학과 일본 동경공업대학 방문교수 한국공업화학회 편집이사 및 재무이사 한국고분자학회 평이사 에너지기술평가원 고급에너지 인력양성사업 단장"},{"type":"table","name":"학력","data":[{"cells":[{"name":"학위","value":"공학사"},{"name":"기관","value":"서강대학교"},{"name":"연도","value":"1986"}]},{"cells":[{"name":"학위","value":"공학석사"},{"name":"기관","value":"University of Tsukuba"},{"name":"연도","value":"1989"}]},{"cells":[{"name":"학위","value":"공학박사"},{"name":"기관","value":"University of Tsukuba"},{"name":"연도","value":"1993"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"항목","value":"담당자"},{"name":"내용","value":"서강대학교산학협력단"}]},{"cells":[{"name":"항목","value":"이메일"},{"name":"내용","value":"tlo@sogang.ac.kr"}]},{"cells":[{"name":"항목","value":"연락처"},{"name":"내용","value":"02-3274-4863"}]}]},{"type":"text","name":"보유 기술","data":""}]}