{"name":"김홍석","email":"hongseok@sogang.ac.kr","introduce":"AI 기반 에너지 시스템 연구 교수","keywords":["배터리진단","머신러닝","ESS","딥러닝","V2G","인공지능","마이크로그리드","IoT","에너지시스템","재생에너지","최적화","전력망","스마트그리드","전력조류계산","무선통신"],"skills":["인공지능(AI)","머신러닝","전력망 최적화","배터리 성능 진단","수명 예측","ESS 충방전 제어","재생에너지 발전량 예측","AC Optimal Power Flow","물리 정보 신경망","전기화학-머신러닝 하이브리드 모델","마이크로그리드 전력 분배","V2G(Vehicle-to-Grid) 플랫폼 운영","딥러닝 예측"],"cards":[{"type":"text","name":"AI 요약","data":"서강대학교 전자공학전공 김홍석 교수는 인공지능(AI)과 머신러닝 기술을 기반으로 복잡한 에너지 시스템과 전력망의 효율성 및 안정성 문제를 해결하는 연구를 수행하고 있습니다. 전력망 최적화, 배터리 성능 진단 및 수명 예측, 에너지 저장장치(ESS) 충방전 제어, 재생에너지 발전량 예측 등 다양한 분야에서 혁신적인 알고리즘과 모델을 개발하여 에너지 효율 증진과 안정적인 전력 공급에 기여하고 있습니다. 특히, AI 기반의 전력망 최적 조류 계산, 전기화학-머신러닝 하이브리드 배터리 모델, 마이크로그리드 전력 분배 기술 등 다수의 연구 과제와 특허를 통해 실질적인 성과를 창출하고 있으며, 미래 에너지 기술 발전에 중요한 역할을 하고 있습니다. 그의 연구는 지속 가능한 에너지 시스템 구축과 스마트 그리드 구현을 목표로 합니다."},{"type":"table","name":"기본 정보","data":[{"cells":[{"name":"직책","value":"교수"},{"name":"소속","value":"서강대학교"},{"name":"학과","value":"전자공학과"}]},{"cells":[{"name":"사무실 번호","value":"027057989"}]},{"cells":[{"name":"연구실","value":"NICE LAB"}]}]},{"type":"links","name":"주요 링크","data":[{"name":"연구자 홈페이지","href":"https://nice.sogang.ac.kr/professor"},{"name":"연구실 홈페이지","href":"https://nice.sogang.ac.kr/"}]},{"type":"text","name":"연구분야: AI 기반 에너지 시스템 최적화","data":"본 연구실은 인공지능(AI)과 머신러닝 기술을 기반으로 복잡한 에너지 시스템과 전력망의 효율성 및 안정성 문제를 해결하는 연구를 수행하고 있습니다. 특히, AI 기반 전력망 최적 조류 계산(AC Optimal Power Flow), 재생에너지 발전량 예측, 전력망 최적화 알고리즘 개발에 주력하며, 국가 전력망 최적화를 위한 하드웨어 가속 물리 정보 신경망 연구를 NRF로부터 수주하는 등 활발한 연구를 진행 중입니다. 또한 '인공지능 GridFM 연구', '인공신경망 기반 기동정지계획 수립 기술 시작품 제작', '인공지능 AC OPF 파운데이션 모델 연구' 등 다수의 과제를 총괄하며 실질적인 성과를 창출하고 있습니다. 관련 논문으로는 'Unsupervised Deep Lagrange Dual With Equation Embedding for AC Optimal Power Flow', 'Graph-Based Large Scale Probabilistic PV Power Forecasting Insensitive to Space-Time Missing Data', 'Deep Reinforcement Learning Based Real-Time Renewable Energy Bidding With Battery Control' 등이 있습니다. 이러한 연구는 에너지 효율 증진과 안정적인 전력 공급에 기여하며 지속 가능한 에너지 시스템 구축과 스마트 그리드 구현을 목표로 합니다."},{"type":"text","name":"연구분야: 배터리 성능 진단 및 관리 기술","data":"김홍석 교수는 배터리 성능 진단 및 수명 예측, 에너지 저장장치(ESS) 충방전 제어 등 배터리 기술의 핵심 분야를 인공지능 및 머신러닝 기반으로 연구하고 있습니다. 특히 '고전압 배터리 내부상태 정밀진단을 위한 전기화학-머신러닝 하이브리드 모델' 연구 과제를 수행하였으며, 두산에너빌리티에 ESS 배터리의 잔존수명 예측 및 화재위험 추정 기술을 개발하여 전수했습니다. 이와 관련된 주요 특허로는 '물리학적 모델과 딥러닝 모델을 기반으로 하는 배터리 위험 모듈 탐지 장치 및 그 방법', '전압 강하 차이를 이용한 배터리 이상 모듈 탐지 장치 및 그 방법', '감가상각밀도 함수를 이용한 배터리의 감가상각 모델링 방법' 등이 있습니다. 또한 'ProADD: Proactive battery anomaly dual detection leveraging denoising convolutional autoencoder and incremental voltage analysis', 'LSTM-Based Battery Remaining Useful Life Prediction With Multi-Channel Charging Profiles' 등의 논문을 발표하며 배터리 시스템의 안전성, 효율성 및 경제성 향상에 기여하고 있습니다. 에너지 저장장치 수명 비용 최적화 충방전 스케줄링 관련 기술이전 경험도 보유하고 있습니다."},{"type":"text","name":"연구분야: 스마트 그리드 및 분산 에너지 최적화","data":"본 연구 분야는 마이크로그리드, 재생에너지 통합, V2G(Vehicle-to-Grid) 플랫폼 운영 등 스마트 그리드 환경에서의 분산 에너지 자원 최적화에 초점을 맞추고 있습니다. 분산 에너지 시장에서의 마이크로그리드 직접 에너지 거래 메커니즘 및 전력 분배 기술 개발에 선도적인 연구를 수행하며 '마이크로그리드 간 전력 분배 시스템 및 전력 분배 방법' 특허를 보유하고 있습니다. 관련 논문으로는 'Fully Decentralized Peer-to-Peer Community Grid With Dynamic and Congestion Pricing', 'Direct Energy Trading of Microgrids in Distribution Energy Market', 'Optimal Energy Scheduling and Transaction Mechanism for Multiple Microgrids' 등이 있습니다. 특히, 미래 배전망사업자(DSO) 환경에서 최적조류계산, 딥러닝 예측, P2P 거래를 통한 분산 최적화를 통합하는 스마트 전력 시장 프레임워크를 제안하여 국제 저명 저널 Applied Energy에 게재하는 성과를 거두었습니다. 이를 통해 배전망 혼잡도를 완화하고 전압 안정성을 향상시키며, 운영 비용 절감 및 전력 시스템 신뢰도 개선에 실질적으로 기여하고 있습니다. 다양한 불확실성을 고려한 가정 에너지 스케줄링 시스템 및 방법 특허 개발을 통해 지속 가능한 에너지 시스템 구축과 스마트 그리드 구현을 위한 핵심 기술을 제공합니다."},{"type":"table","name":"경력정보","data":[{"cells":[{"name":"기간","value":"2015.09.01 ~ 재직중 (10년 2개월)"},{"name":"기관","value":"서강대학교"},{"name":"직책","value":"전자공학전공 교수"},{"name":"세부 활동","value":"AI 기반 에너지 시스템 최적화, 배터리 진단 및 관리 기술, 재생에너지 예측 및 스마트 그리드 운영 등 다양한 연구 및 교육 활동을 수행하며 다수의 국가 및 산학 연구 과제를 총괄했습니다. 주요 과제로는 인공지능 GridFM 연구, 인공신경망 기반 기동정지계획 수립 기술 시작품 제작, 고전압 배터리 내부상태 정밀진단을 위한 전기화학-머신러닝 하이브리드 모델 연구 등이 있습니다."}]},{"cells":[{"name":"기간","value":"2017.07.01 ~ 2018.07.01 (1년)"},{"name":"기관","value":"브리티시컬럼비아 대학교"},{"name":"직책","value":"방문 부교수"},{"name":"세부 활동","value":"연구 활동을 수행했습니다."}]}]},{"type":"text","name":"대외활동","data":"[기술 강연] - LG화학, 중앙대학교, 숭실대학교, 한국항공대학교, 효성 CTO 연구개발센터, 산업교육연구소 등에서 강연을 진행했습니다. [학회/위원회 활동] - IEEE Globecom (2014, 2013, 2016), IEEE INFOCOM Workshop (2014), APCC (2013), IEEE ICC (2013 SAC), IEEE Globecom (2013 WC)의 TPC(기술 프로그램 위원회)로 활동했습니다. - 2014년 1월부터 IEIE Journal of Telecommunications 편집위원으로 활동했습니다. [수상 내역] - 2016년 12월 해동과학문화재단 해동젊은교수상을 수상했습니다."},{"type":"table","name":"학력","data":[{"cells":[{"name":"기관","value":"University of Texas at Austin"},{"name":"학위","value":"전기컴퓨터공학 Ph.D."},{"name":"졸업 연도","value":"2009"}]}]},{"type":"table","name":"문의처 (서강대학교)","data":[{"cells":[{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]}]}