{"name":"이철수","email":"tlo@sogang.ac.kr","introduce":"로봇, 의료기기, 정밀가공 전문가","keywords":["금속성형","로봇자동화","매니플레이터","레이저가공","비전검사","산업자동화","체내이식형펌프","방사성의약품","정밀제조","기계공학","공정자동화","약물전달","의료기기","시스템제어","스마트팩토리"],"skills":["로봇 자동화","시스템 제어","의료기기 개발","방사성의약품 제조 시스템","정밀 가공","비전 검사","레이저 가공","금속성형","강화학습","CNC 제어"],"cards":[{"type":"text","name":"소개","data":"이철수 교수님은 서강대학교 기계공학전공 교수로서, 로봇 및 자동화 시스템, 방사성의약품 관련 장비, 체내 이식형 의료기기 분야에서 활발한 연구를 수행하고 계십니다. 다수의 국가 과제 및 산학협력을 통해 박판 비전 검사 시스템, 방사성의약품 자동 생산/분주 시스템, 6축 다관절 로봇 매니플레이터, 약물 주입 펌프 등의 기술 개발에 크게 기여하셨습니다. 등록된 다수의 특허에서도 그의 심도 깊은 기술적 역량과 실용적인 연구 성과가 잘 드러나고 있습니다. 이철수 교수님은 기계공학 및 융합 기술 발전에 기여하며 산업 현장의 혁신을 이끌고 계십니다."},{"type":"text","name":"로봇 자동화 및 시스템 제어","data":"본 연구실은 로봇 자동화 시스템과 정교한 시스템 제어 기술 개발에 중점을 두고 혁신적인 연구를 수행하고 있습니다. 특히, 6축 다관절 로봇 및 SCARA 로봇 매니플레이터의 설계와 제어 기술 개발에 집중하여 산업 현장의 자동화 및 효율성 증진에 기여하고 있습니다. 로봇의 정밀한 움직임을 제어하기 위한 센서 기술 개발과 함께, 로봇 강화학습을 활용하여 공 던지기 및 보틀플리핑과 같은 복잡한 작업을 로봇이 스스로 학습하고 수행할 수 있도록 하는 연구를 진행하고 있습니다. 이러한 로봇 기술은 방사성의약품 자동분주시스템 개발 등 다양한 분야에 성공적으로 적용되어 왔으며, CNC 컨트롤러 및 5축 가공 기술과 같은 정밀 제어 시스템 개발에도 핵심적인 역할을 수행하고 있습니다. 본 연구는 스마트 팩토리 구현의 기반 기술로서, 제조 공정의 생산성을 극대화하고 자동화 수준을 높이는 데 실질적인 가치를 창출하고 있습니다."},{"type":"text","name":"의료기기 및 방사성의약품 제조 시스템","data":"본 연구실은 체내 이식형 의료기기 및 방사성의약품 제조 관련 장비 개발 분야에서 선도적인 연구를 수행하고 있습니다. 특히, 만성 질환 환자의 삶의 질을 향상시키기 위한 약물 전달용 체내 이식형 펌프 시스템 개발에 주력해왔습니다. 이는 호스피스 통증 완화 치료를 위한 펌프 하우징 및 부품 개발로 이어졌으며, 약물의 역류 방지와 정량 토출이 가능한 연동장치 및 튜브리스 시스템 개발을 통해 기술력을 확보했습니다. 또한, PET용 방사성의약품의 고수율 자동 합성 시스템 및 자동 생산/분주 시스템 개발에 크게 기여했습니다. 로봇을 활용한 방사성의약품 자동분주 시스템 개발, 합성장치 하드웨어 및 운영 시스템 개선, 그리고 카세트 조립성 검사장치 개발 등을 통해 방사성의약품의 안정적이고 효율적인 생산을 위한 핵심 기술을 확보했습니다. 이러한 연구 성과는 다수의 특허 등록으로 이어졌으며, 의료 현장에 실질적으로 적용 가능한 기술을 제공함으로써 국민 건강 증진에 기여하고 있습니다."},{"type":"text","name":"정밀 가공 및 비전 검사 기술","data":"본 연구실은 금속성형, 레이저가공을 포함한 정밀 제조 및 공정 자동화 기술, 그리고 고정밀 비전 검사 시스템 개발에 강점을 가지고 있습니다. 특히, 박판 비전 검사 시스템 개발을 통해 제조 공정에서의 품질 관리를 자동화하고 효율을 높였습니다. 금속 성형 분야에서는 휠 플로우포밍 장치 및 방법을 연구하여, 조립식 멘드렐과 다채널 컴퓨터 수치 제어를 통해 다품종 휠 생산성과 가공성을 개선했습니다. 레이저 가공 분야에서는 레이저 빔을 이용한 3차원 메탈 폴리싱 및 커팅 기술, 하이드로포밍 제품 가공을 위한 다축 레이저 커팅 시스템 개발을 통해 정밀 가공 능력을 고도화했습니다. 또한, 미소압흔 주변에 디지털 화상적합기술을 적용하여 재료 물성치와 응력 상태를 측정하는 장치 및 방법을 개발하는 등 비파괴 검사 기술에도 깊이 있는 연구를 진행했습니다. 이러한 연구는 현대 산업의 핵심인 정밀 제조 및 품질 관리 분야에서 생산성 향상과 비용 절감에 크게 기여하고 있습니다."},{"type":"table","name":"학력","data":[{"cells":[{"name":"기관","value":"한양대학교"},{"name":"전공","value":"산업공학과"},{"name":"학위","value":"학사"}]},{"cells":[{"name":"기관","value":"KAIST"},{"name":"전공","value":"산업공학과"},{"name":"학위","value":"석사"}]},{"cells":[{"name":"기관","value":"KAIST"},{"name":"전공","value":"산업공학과"},{"name":"학위","value":"박사"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]}]}