{"name":"김동철","email":"dckim@sogang.ac.kr","introduce":"AI/다중물리 융합 연구 선도","keywords":["머신러닝","메타물질","다중물리해석","나노기술","내구특성","재료공학","예측모델","인공지능","계산역학","구조해석","유한요소해석","배터리기술","생체재료","시뮬레이션","파단예측"],"skills":["인공지능(AI)","머신러닝","다중물리해석","다중스케일 모델링","시뮬레이션","계산역학","구조해석","유한요소해석","재료 파단 예측","메타물질 설계","나노기술","재료공학","내구특성 예측"],"cards":[{"type":"text","name":"AI 요약","data":"서강대학교 기계공학전공 김동철 교수는 인공지능(AI)과 다중 물리(Multi-physics) 해석 기술을 융합하여 첨단 재료 및 기계 시스템의 성능을 예측하고 최적화하는 연구를 선도하고 있습니다. 복잡한 기계적 거동 및 재료 파단 현상 분석부터 차체 조립 품질 예측, 배터리 성능 향상, 메타물질 개발에 이르기까지 폭넓은 분야에서 혁신적인 시뮬레이션 모델을 제시합니다. 특히, AI를 활용하여 설계 기술을 고도화하고 내구 특성을 예측하는 연구는 산업 현장의 난제를 해결하며 미래 기술 발전에 기여하고 있습니다. 김동철 교수의 연구는 기계공학 분야의 당면 과제를 해결하고, 스마트 제조 및 신소재 개발을 가속화하는 데 중요한 역할을 합니다. 본 프로필에서 김동철 교수의 주요 연구 과제, 발표 논문, 등록 특허 등 폭넓은 연구 성과를 상세히 확인하실 수 있습니다."},{"type":"table","name":"기본 정보","data":[{"cells":[{"name":"직책","value":"교수"}]},{"cells":[{"name":"소속","value":"서강대학교"}]},{"cells":[{"name":"부서","value":"기계공학과"}]},{"cells":[{"name":"사무실 번호","value":"027058643"}]},{"cells":[{"name":"이메일","value":"dckim@sogang.ac.kr"}]},{"cells":[{"name":"연구실","value":"다중물리&다중스케일 시스템 연구실"}]},{"cells":[{"name":"연구실 홈페이지","value":"https://mmslab.sogang.ac.kr/"}]}]},{"type":"text","name":"AI 기반 기계공학 및 산업 제조 시뮬레이션","data":"본 연구실은 인공지능(AI)과 머신러닝 기술을 활용하여 기계 시스템 및 산업 제조 공정의 성능을 예측하고 최적화하는 혁신적인 연구를 수행하고 있습니다. 특히, 최신 AI/머신러닝 기법을 계산역학, 구조해석, 유한요소해석 등 전통적인 기계공학 해석과 융합하는 데 중점을 둡니다. 물리정보 기반 인공지능(PINNs)을 활용한 설계기술 개발, 빅데이터 AI 활용 기계적 체결 품질 예측 기술, 충돌해석 파단 예측을 위한 머신러닝 기반 재료모델 개발 등의 과제를 통해 실제 산업 문제 해결에 기여하고 있습니다. 복잡한 비선형 거동, 재료 파단 현상, 마모 특성 등을 AI 기반으로 정밀하게 예측하여 기존 시뮬레이션의 한계를 극복하고 있으며, 차체 조립 품질 예측, 생산설비 설계 최적화, 배터리 성능 예측, 비선형 진동 마모 해석 등 다양한 산업 현장에 적용되어 제품 개발 기간 단축 및 성능 향상에 기여합니다. 관련 연구 성과는 'Prediction of load-displacement curves of flow drill screw and RIVTAC joints between dissimilar materials using artificial neural networks' 및 'Identification and Reconstruction of Impact Load for Lightweight Design of Production Equipment' 등의 논문을 통해 발표되었습니다."},{"type":"text","name":"다중 물리 및 다중 스케일 해석 기술","data":"본 연구실은 다중 물리 현상(열, 유체, 구조 등)과 서로 다른 스케일(나노, 마이크로, 매크로)의 복합적인 상호작용을 통합적으로 분석하고 예측하는 원천 기술 개발에 주력하고 있습니다. 다중물리해석 및 다중스케일 모델링 및 시뮬레이션 기법을 활용하여 복잡한 시스템의 거동을 심층적으로 이해하며, 유한요소해석, 계산역학 등을 기반으로 배터리 기술의 덴드라이트 성장 예측, 재료 물성 설계, Creep 변형 Simulation 등 다양한 현상을 모델링하고 있습니다. 이러한 연구는 실제 현상에 근접한 정확하고 신뢰성 높은 시뮬레이션 모델을 구축하여, 실험 비용과 시간을 절감하고 효율적인 설계를 가능하게 합니다. PCB Damage 해석 모델, Multipe-Impact에 의한 Damage 해석 모델 개발, 알루미늄 주조재 물성 산포 고려 파단 예측 모델 개발, 최적 이종접합법 선정을 위한 파단 모드 및 강도 예측 기술 등의 과제를 수행하며 재료의 내구특성 및 파단예측 분야에서 선도적인 성과를 창출하고 있습니다. 관련 주요 논문으로는 'Ductile fracture prediction in thin-walled structures through a novel damage model', 'Modeling asymmetric fracture mechanics of Mg alloy wire in drawing process', 'Multiphysics and Multiscale Analysis for Chemotherapeutic Drug' 등이 있습니다."},{"type":"text","name":"메타물질 및 나노 재료 설계","data":"본 연구실은 기존 재료의 한계를 뛰어넘는 새로운 기능과 특성을 갖는 메타물질 및 나노기술 기반 첨단 재료공학 설계 및 개발을 선도하고 있습니다. 나노 스케일에서의 물질 특성 제어 및 메타구조 설계를 통해 물리적, 역학적 특성을 최적화하는 연구를 진행하며, 머신러닝을 활용한 열흐름제어 메타물질 개발, 우수한 충격흡수 성능을 갖는 초경량 메타구조 연구를 통해 경량화, 충격 흡수 등 다양한 기능 구현에 성공했습니다. 이러한 연구는 이론적 설계와 실제 구현 가능성을 동시에 고려하며, 정밀한 시뮬레이션을 통해 복합 기능성 메타구조의 성능을 예측하고 검증합니다. 전기자동차 경량화 기술, UAM(Urban Air Mobility) 낙하 사고 안전을 위한 충격 흡수 메타구조, 배수 및 습윤 마찰력을 갖는 복합기능 메타물질 개발 등 미래 모빌리티 및 고기능성 제품 개발에 핵심적인 기여를 하고 있습니다. 대표적인 연구 성과는 'Enhanced Molecular Interaction of 3D Plasmonic Nanoporous Gold Alloys by Electronic Modulation for Sensitive Molecular Detection', 'Three-Dimensional Polymeric Mechanical Metamaterials Fabricated by Multibeam Interference Lithography', 'Controlled Unusual Stiffness of Mechanical Metamaterials' 등의 논문을 통해 확인하실 수 있습니다."},{"type":"table","name":"학력","data":[{"cells":[{"name":"학위","value":"박사"},{"name":"기관","value":"University of Michigan 기계공학"}]},{"cells":[{"name":"학위","value":"석사"},{"name":"기관","value":"University of Michigan 기계공학"}]},{"cells":[{"name":"학위","value":"학사"},{"name":"기관","value":"연세대학교 기계공학"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"소속","value":"서강대학교"}]},{"cells":[{"name":"담당자","value":"서강대학교산학협력단"}]},{"cells":[{"name":"이메일","value":"tlo@sogang.ac.kr"}]},{"cells":[{"name":"연락처","value":"02-3274-4863"}]}]},{"type":"text","name":"보유 기술","data":""},{"type":"links","name":"참고 링크","data":[{"name":"서강대학교 연구자 페이지","href":"https://www.sogangtech.com/researcher/296"}]}]}