{"name":"최범규","email":"tlo@sogang.ac.kr","introduce":"MEMS, 센서, 의료기기 연구 선구자","keywords":["자율진단","SAW센서","에너지하베스팅","생체역학","지능형재료","바이오메디컬","무선센서","유한요소해석","압력센서","체내삽입형","나노센서","MEMS","마이크로믹서","의료기기","스마트타이어"],"skills":[],"cards":[{"type":"text","name":"AI 요약","data":"최범규 서강대학교 기계공학전공 교수님은 MEMS, 센서 및 의료기기 분야의 선구적인 연구를 수행하고 계십니다. 복잡한 생체 역학 문제를 해결하기 위한 유한요소 시뮬레이션부터 인체 삽입형 스마트 센서, 무전원 무선 센서 개발에 이르기까지 폭넓은 연구 스펙트럼을 자랑합니다. 특히 인공 요도괄약근, 방광 내압 모니터링 시스템 등 혁신적인 의료기기 개발과 마이크로 믹서, 에너지 하베스팅 기술 개발을 통해 차세대 정밀 공학 및 스마트 헬스케어 발전에 크게 기여하고 있습니다. 교수님의 연구는 실제 산업 및 의료 현장에 적용 가능한 실질적인 해결책을 제시하며 미래 기술 발전을 선도하고 있습니다."},{"type":"text","name":"MEMS 및 스마트 센서 시스템 개발","data":"본 연구실은 MEMS(미소전자기계시스템) 기술을 기반으로 한 혁신적인 스마트 센서 시스템 개발에 중점을 두고 있습니다. 특히 무선 및 무전원 센서 기술 개발에 선구적인 역할을 하며, SAW 센서, 압력 센서, 나노 센서 등 다양한 종류의 센서를 연구하고 있습니다. 인체 삽입형 스마트 센서 개발을 통해 정밀 의료 분야에 기여하고 있으며, 스마트 타이어 센서 기술처럼 산업 현장의 요구에 부응하는 실용적인 솔루션도 제공합니다. 이러한 센서 시스템은 자율 진단 기능을 통합하여 복잡한 환경에서도 신뢰성 높은 데이터를 제공하며, 다양한 응용 분야에서 핵심적인 역할을 수행합니다. 연구실은 센서의 소형화, 고감도화, 저전력화에 집중하며 차세대 스마트 디바이스의 기반 기술을 구축하고 있습니다."},{"type":"text","name":"바이오메디컬 시스템 및 지능형 의료기기 공학","data":"최범규 교수 연구실은 바이오메디컬 분야의 난제를 해결하기 위한 첨단 시스템 및 지능형 의료기기 개발을 선도합니다. 복잡한 생체 역학적 현상을 분석하기 위해 유한요소 시뮬레이션 기법을 활용하며, 이를 기반으로 인체 삽입형 스마트 센서와 같은 정밀 의료기기를 설계하고 있습니다. 특히 인공 요도괄약근, 방광 내압 모니터링 시스템 등 환자의 삶의 질을 향상시키는 혁신적인 의료기기 개발에 성공적인 성과를 보여왔습니다. 이러한 연구는 질병 진단, 치료 및 모니터링 과정을 개선하여 스마트 헬스케어의 미래를 제시하며, 실제 임상 적용 가능한 솔루션을 제공함으로써 의료 기술 발전에 크게 기여하고 있습니다."},{"type":"text","name":"에너지 하베스팅 및 마이크로 유체 역학 기술","data":"본 연구실은 지속 가능한 기술 발전을 위해 에너지 하베스팅 및 마이크로 유체 역학 기술을 심층적으로 연구하고 있습니다. 주변 환경에서 버려지는 에너지를 효율적으로 수집하여 전력으로 변환하는 에너지 하베스팅 기술은 무전원 센서 시스템의 핵심 동력원으로 활용됩니다. 이와 함께 마이크로 단위의 유체를 정밀하게 제어하고 혼합하는 마이크로 믹서 및 유체 소자 개발은 LOC(Lab-on-a-Chip) 기술과 같은 생명 과학 및 화학 분석 분야에 혁신적인 솔루션을 제공합니다. 마이크로 터빈의 설계 및 시뮬레이션 등 미세 유체 기계 시스템에 대한 깊이 있는 이해를 바탕으로, 정밀 제어가 필요한 다양한 분야에서 새로운 가능성을 열어가고 있으며, 차세대 스마트 시스템의 자율성과 효율성을 극대화하는 데 기여하고 있습니다."},{"type":"table","name":"학력","data":[{"cells":[{"name":"기간","value":"1977 - 1981"},{"name":"기관","value":"Seoul National University"},{"name":"전공","value":"Mechanical Eng"},{"name":"학위","value":"B.S"}]},{"cells":[{"name":"기간","value":"1981 - 1983"},{"name":"기관","value":"Seoul National University"},{"name":"전공","value":"Mechanical Eng"},{"name":"학위","value":"M.S"}]},{"cells":[{"name":"기간","value":"1988 - 1992"},{"name":"기관","value":"University of Wisconsin"},{"name":"전공","value":"Mechanical Eng"},{"name":"학위","value":"Ph.D"}]}]},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]}]}