{"name":"김광수","email":"tlo@sogang.ac.kr","introduce":"전력 반도체 전문가","keywords":["MOSFET","TFT","전력반도체","트렌치","회로","EV/HEV","SiC","기술개발","에너지변환","반도체","신뢰성","센서","소자","차량용","전자공학"],"skills":["SiC 전력 반도체 소자 개발","신뢰성 분석","MOSFET 설계 및 제조","트렌치 구조 반도체 소자 기술","산화물 TFT 개발","소자-회로 연계 해석","고효율 전력반도체 설계","Oxygen Sensing Module 개발","압전 에너지 변환기 설계 및 제작","EV/HEV용 반도체 기술"],"cards":[{"type":"text","name":"AI 요약","data":"김광수 교수님은 서강대학교 전자공학전공 소속으로, 반도체 소자 분야의 깊이 있는 연구를 수행하고 계십니다. 특히, MOSFET, SiC 전력 반도체, 산화물 TFT 등 차세대 전력 및 시스템 반도체 소자 개발에 주력하시어 관련 기술 발전에 크게 기여하고 계십니다. 교수님의 연구는 소자-회로 연계 신뢰성 해석, 고효율 전력반도체 설계, 트렌치 구조 기반의 소자 제조 방법에 이르기까지 광범위합니다. 다수의 국내외 특허 출원 및 등록을 통해 그 기술력을 입증하셨으며, EV/HEV용 반도체와 같은 미래 기술 분야에도 활발히 참여하고 계십니다. 본 프로필은 교수님의 핵심 연구 역량과 성과를 한눈에 파악할 수 있도록 상세히 정리하였습니다."},{"type":"text","name":"SiC 전력 반도체 소자 개발 및 신뢰성 분석","data":"본 연구실은 차세대 전력 반도체 소자의 핵심인 SiC(실리콘 카바이드) 기반 소자 개발 및 특성 분석에 주력하고 있습니다. 특히 4H-SiC Double Trench MOSFET, Super Junction Power MOSFET, 그리고 MOS 채널 다이오드가 내장된 SiC MOSFET 등 다양한 구조의 소자를 설계하고 제조 방법을 연구하며, 향상된 스위칭 성능과 높은 항복 전압 특성을 구현하는 데 집중하고 있습니다. 또한 소자-회로 연계 신뢰성 해석 기술 개발을 통해 SiC MOSFET의 게이트 유전체 물질에 따른 온도 신뢰성, Single-Event Burnout 경화 특성 등 극한 환경에서의 안정성을 심도 있게 분석하고 있습니다. 이러한 연구는 고효율 전력 변환 시스템과 전기차(EV/HEV)용 반도체 개발에 필수적인 기반 기술을 제공하며, 관련 산업의 기술 발전에 크게 기여하고 있습니다. 본 연구실의 SiC 전력 반도체 소자 연구는 이론적 설계부터 실제 소자 특성 평가 및 신뢰성 확보에 이르는 전 과정을 아우르며, 미래 전력 전자 기술의 혁신을 선도하고 있습니다."},{"type":"text","name":"차세대 MOSFET 및 트렌치 구조 반도체 소자 기술","data":"본 연구실은 차세대 전력 반도체 소자로서 MOSFET(금속 산화물 반도체 전계 효과 트랜지스터) 및 다양한 트렌치(Trench) 구조 기반의 소자 기술 개발에 집중하고 있습니다. 트렌치 구조는 소자 온저항을 낮추고 항복 전압을 높여 전력 소자의 성능을 획기적으로 개선하는 핵심 기술입니다. Super Junction Power MOSFET, Source-Trench Optimization을 통한 고항복 전압 및 저온저항 SiC UMOSFET, 그리고 트렌치 메탈 구조를 갖는 슈퍼 정션 MOSFET 등 다양한 혁신적인 MOSFET 구조를 제안하고, 이들의 전기적 특성 및 최적화된 제조 방법을 연구합니다. 또한 산화물 TFT(박막 트랜지스터)의 성능 개선 연구를 통해 디스플레이 및 유연 전자 소자에 적용 가능한 차세대 소자 기술을 탐구하고 있습니다. 이러한 연구는 반도체 소자의 기본 성능 한계를 극복하고, 더욱 작고 효율적인 전력 및 시스템 반도체 소자 구현을 위한 핵심 기술을 제공하며, 에너지 효율 향상과 소자 집적도 증대에 기여합니다."},{"type":"text","name":"전력 및 시스템 반도체 소자 응용 및 신뢰성 연동 기술","data":"본 연구실은 개발된 고성능 전력 및 시스템 반도체 소자의 실제 응용 분야 확장을 위한 연동 기술 및 신뢰성 확보에 중점을 둡니다. 특히 EV/HEV(전기/하이브리드 자동차)용 고효율 전력반도체 소자 연구를 통해 차량용 전력 시스템의 효율과 안정성 향상에 기여하고 있습니다. 소자 단위를 넘어 소자-회로 연계 신뢰성 해석 기술 개발을 수행하여, 개별 소자의 특성이 회로 시스템 전체의 성능과 신뢰성에 미치는 영향을 종합적으로 분석하고 최적화 방안을 제시합니다. 또한 차량용 운영체제와 센서 기반 신호처리 연동 기술 연구를 통해 반도체 소자가 다양한 센서 및 제어 시스템과 효율적으로 결합될 수 있는 방법을 탐구합니다. 이 외에도 Oxygen Sensing Module 개발, 진동을 이용한 압전 에너지 변환기 설계 및 제작 등 다양한 응용 분야에서의 반도체 소자 활용 가능성을 모색하고 있습니다. 이러한 연구는 미래 모빌리티, 에너지 변환, 스마트 센싱 등 첨단 산업 분야에서 반도체 기술의 실질적인 가치를 창출하는 것을 목표로 합니다."},{"type":"table","name":"문의처","data":[{"cells":[{"name":"소속","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]}]}