{"name":"최우영","email":null,"introduce":"차세대 반도체 연구 선도","keywords":["낸드 플래시","TFET","강유전체 FET","인공지능 반도체","인메모리 컴퓨팅","메모리 기술","3D CTF","뉴로모픽 컴퓨팅","나노전기기계","저전력 소자","시냅스 회로","신뢰성 분석","차세대 반도체","비휘발성 메모리 소자","모델링"],"skills":[],"cards":[{"type":"text","name":"상태","data":"휴직·퇴직 중인 연구자인 경우 연구협력 요청이 제한됩니다."},{"type":"text","name":"AI 요약","data":"최우영 교수는 서강대학교 전자공학전공 교수로, 차세대 반도체 기술 분야의 선도적인 연구자입니다. 인공지능 반도체, 초저전력 비휘발성 메모리 소자, 나노전기기계(NEM) 소자, 그리고 터널링 전계효과 트랜지스터(TFET) 등 미래형 소자 및 시스템 개발에 집중하고 있습니다. 특히 3D 집적 기술과 두뇌모방 연산 기술을 통해 저전력 고효율 컴퓨팅 솔루션을 제시하며, 국내외 유수의 기관들과 협력하여 반도체 기술 발전에 기여하고 있습니다. 혁신적인 연구 성과와 다수의 특허를 통해 차세대 반도체 분야의 난제를 해결하고 있습니다."},{"type":"table","name":"소속 정보","data":[{"cells":[{"name":"소속","value":"서강대학교"},{"name":"부서","value":"전자공학과"},{"name":"직책","value":"교수"}]}]},{"type":"text","name":"연구분야: 차세대 비휘발성 메모리 및 3D 집적 기술","data":"본 연구실은 차세대 컴퓨팅 환경에 필수적인 비휘발성 메모리 기술과 고집적 3D 구조 연구를 선도합니다. 특히 낸드 플래시, 강유전체 FET, TFET 등 다양한 비휘발성 메모리 소자의 특성과 신뢰성을 분석하고, 이들을 3D로 집적하는 기술을 개발하여 전력 효율과 성능을 극대화하고 있습니다. 3D CTF 기반 캐패시티브 인메모리 컴퓨팅 기술을 확보하여 데이터 처리 속도와 에너지 효율을 혁신적으로 개선하는 연구를 수행 중입니다. 이러한 연구는 기존 메모리 한계를 극복하고, 미래 고성능 컴퓨팅 및 엣지 AI 시스템에 핵심적인 솔루션을 제공하는 것을 목표로 합니다. 신소자 모델링 및 신뢰성 분석을 통해 소자의 잠재력을 최대한 발휘하고, 대용량 데이터를 효율적으로 저장하고 처리하는 차세대 메모리 아키텍처를 구현합니다. 다수의 국내외 프로젝트와 특허를 통해 이론적 깊이와 실용적 가치를 동시에 추구하며, 반도체 산업 발전에 기여하고 있습니다."},{"type":"text","name":"연구분야: 인공지능 및 뉴로모픽 반도체 소자","data":"본 연구실은 인공지능(AI) 시대의 핵심인 저전력 고효율 AI 반도체 및 뉴로모픽 컴퓨팅 기술 개발에 주력하고 있습니다. 특히 인간 두뇌의 연산 방식을 모방한 뉴로모픽 시스템 구현을 위해 시냅스 및 뉴런 회로를 신소자 기반으로 동시 구현하는 연구를 진행하고 있습니다. 낸드 플래시 메모리를 활용한 BNN(Binary Neural Network) 기술 개발을 통해 온디바이스 AI 프로세서의 성능을 향상시키고 있으며, 초저전력 비휘발성 메모리 소자의 3D 모노리식 집적을 통해 두뇌모방 연산 기술의 효율성을 극대화하고 있습니다. 이러한 기술은 대량의 데이터를 효율적으로 처리하고 학습하는 차세대 AI 하드웨어의 기반이 됩니다. 다양한 산학협력 과제를 통해 실제 산업에 적용 가능한 AI 반도체 솔루션을 제시하며, 미래 AI 기술의 발전에 기여하고 있습니다. 특히 신소자 시냅스 및 뉴런 회로 동시 구현 연구는 인공신경망의 물리적 구현에 있어 중요한 진전을 이루고 있습니다."},{"type":"text","name":"연구분야: 나노전기기계 소자 및 초저전력 스위칭 기술","data":"본 연구실은 극한의 저전력 동작이 가능한 나노전기기계(NEM) 소자와 이를 활용한 차세대 스위칭 기술 연구를 활발히 수행하고 있습니다. NEM 메모리 스위치를 이용한 인메모리 최근접 이웃 탐색(Nearest Neighbor Search) 기술 및 다중비트 내용 주소화 기억장치 개발을 통해 고속/저전력 데이터 처리를 위한 혁신적인 솔루션을 제시하고 있습니다. 또한, TFET(Tunneling Field-Effect Transistor) 등 초저전력 소자의 특성 분석 및 모델링을 통해 에너지 효율을 극대화하고, 나노융합기술 기반의 임베디드 보안 엣지 AI 시스템 개발에 기여하고 있습니다. 본 연구는 NEM 소자의 물리적, 전기적 특성을 심층 분석하고, 다양한 응용 분야에서의 활용 가능성을 탐색합니다. 동적 슬링샷(Dynamic Slingshot) 기반의 저전압 전기기계 스위치 구동 방법을 개발하여 소자의 신뢰성과 동작 전압을 개선하는 등, 나노 스케일에서의 정교한 제어 기술을 확보하고 있습니다. 이러한 연구는 IoT 기기, 엣지 컴퓨팅 등 저전력 고성능을 요구하는 미래 전자 시스템의 발전에 핵심적인 역할을 수행할 것입니다."},{"type":"table","name":"문의처","data":[{"cells":[{"name":"기관","value":"서강대학교"},{"name":"담당자","value":"서강대학교산학협력단"},{"name":"이메일","value":"tlo@sogang.ac.kr"},{"name":"연락처","value":"02-3274-4863"}]}]},{"type":"text","name":"보유 기술","data":""}]}